thtfcccj/CMSIS/hc32f46xb.h
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT10            (*((volatile unsigned int*)(0x42A69EF8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT11            (*((volatile unsigned int*)(0x42A69EFCUL)))
#define bM4_DMA2_DTCTL3_BLKSIZE0                  (*((volatile unsigned int*)(0x42A6A100UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE1                  (*((volatile unsigned int*)(0x42A6A104UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE2                  (*((volatile unsigned int*)(0x42A6A108UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6A10CUL)))
#define bM4_DMA2_DTCTL3_BLKSIZE4                  (*((volatile unsigned int*)(0x42A6A110UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE5                  (*((volatile unsigned int*)(0x42A6A114UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE6                  (*((volatile unsigned int*)(0x42A6A118UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6A11CUL)))
#define bM4_DMA2_DTCTL3_BLKSIZE8                  (*((volatile unsigned int*)(0x42A6A120UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE9                  (*((volatile unsigned int*)(0x42A6A124UL)))
#define bM4_DMA2_DTCTL3_CNT0                      (*((volatile unsigned int*)(0x42A6A140UL)))
#define bM4_DMA2_DTCTL3_CNT1                      (*((volatile unsigned int*)(0x42A6A144UL)))
#define bM4_DMA2_DTCTL3_CNT2                      (*((volatile unsigned int*)(0x42A6A148UL)))
#define bM4_DMA2_DTCTL3_CNT3                      (*((volatile unsigned int*)(0x42A6A14CUL)))
#define bM4_DMA2_DTCTL3_CNT4                      (*((volatile unsigned int*)(0x42A6A150UL)))
#define bM4_DMA2_DTCTL3_CNT5                      (*((volatile unsigned int*)(0x42A6A154UL)))
#define bM4_DMA2_DTCTL3_CNT6                      (*((volatile unsigned int*)(0x42A6A158UL)))
#define bM4_DMA2_DTCTL3_CNT7                      (*((volatile unsigned int*)(0x42A6A15CUL)))
#define bM4_DMA2_DTCTL3_CNT8                      (*((volatile unsigned int*)(0x42A6A160UL)))
#define bM4_DMA2_DTCTL3_CNT9                      (*((volatile unsigned int*)(0x42A6A164UL)))
#define bM4_DMA2_DTCTL3_CNT10                     (*((volatile unsigned int*)(0x42A6A168UL)))
#define bM4_DMA2_DTCTL3_CNT11                     (*((volatile unsigned int*)(0x42A6A16CUL)))
#define bM4_DMA2_DTCTL3_CNT12                     (*((volatile unsigned int*)(0x42A6A170UL)))
#define bM4_DMA2_DTCTL3_CNT13                     (*((volatile unsigned int*)(0x42A6A174UL)))
#define bM4_DMA2_DTCTL3_CNT14                     (*((volatile unsigned int*)(0x42A6A178UL)))
#define bM4_DMA2_DTCTL3_CNT15                     (*((volatile unsigned int*)(0x42A6A17CUL)))
#define bM4_DMA2_RPT3_SRPT0                       (*((volatile unsigned int*)(0x42A6A180UL)))
#define bM4_DMA2_RPT3_SRPT1                       (*((volatile unsigned int*)(0x42A6A184UL)))
#define bM4_DMA2_RPT3_SRPT2                       (*((volatile unsigned int*)(0x42A6A188UL)))
#define bM4_DMA2_RPT3_SRPT3                       (*((volatile unsigned int*)(0x42A6A18CUL)))
#define bM4_DMA2_RPT3_SRPT4                       (*((volatile unsigned int*)(0x42A6A190UL)))
#define bM4_DMA2_RPT3_SRPT5                       (*((volatile unsigned int*)(0x42A6A194UL)))
#define bM4_DMA2_RPT3_SRPT6                       (*((volatile unsigned int*)(0x42A6A198UL)))
#define bM4_DMA2_RPT3_SRPT7                       (*((volatile unsigned int*)(0x42A6A19CUL)))
#define bM4_DMA2_RPT3_SRPT8                       (*((volatile unsigned int*)(0x42A6A1A0UL)))
#define bM4_DMA2_RPT3_SRPT9                       (*((volatile unsigned int*)(0x42A6A1A4UL)))
#define bM4_DMA2_RPT3_DRPT0                       (*((volatile unsigned int*)(0x42A6A1C0UL)))
#define bM4_DMA2_RPT3_DRPT1                       (*((volatile unsigned int*)(0x42A6A1C4UL)))
#define bM4_DMA2_RPT3_DRPT2                       (*((volatile unsigned int*)(0x42A6A1C8UL)))
#define bM4_DMA2_RPT3_DRPT3                       (*((volatile unsigned int*)(0x42A6A1CCUL)))
#define bM4_DMA2_RPT3_DRPT4                       (*((volatile unsigned int*)(0x42A6A1D0UL)))
#define bM4_DMA2_RPT3_DRPT5                       (*((volatile unsigned int*)(0x42A6A1D4UL)))
#define bM4_DMA2_RPT3_DRPT6                       (*((volatile unsigned int*)(0x42A6A1D8UL)))
#define bM4_DMA2_RPT3_DRPT7                       (*((volatile unsigned int*)(0x42A6A1DCUL)))
#define bM4_DMA2_RPT3_DRPT8                       (*((volatile unsigned int*)(0x42A6A1E0UL)))
#define bM4_DMA2_RPT3_DRPT9                       (*((volatile unsigned int*)(0x42A6A1E4UL)))
#define bM4_DMA2_RPTB3_SRPTB0                     (*((volatile unsigned int*)(0x42A6A180UL)))
#define bM4_DMA2_RPTB3_SRPTB1                     (*((volatile unsigned int*)(0x42A6A184UL)))
#define bM4_DMA2_RPTB3_SRPTB2                     (*((volatile unsigned int*)(0x42A6A188UL)))
#define bM4_DMA2_RPTB3_SRPTB3                     (*((volatile unsigned int*)(0x42A6A18CUL)))
#define bM4_DMA2_RPTB3_SRPTB4                     (*((volatile unsigned int*)(0x42A6A190UL)))
#define bM4_DMA2_RPTB3_SRPTB5                     (*((volatile unsigned int*)(0x42A6A194UL)))
#define bM4_DMA2_RPTB3_SRPTB6                     (*((volatile unsigned int*)(0x42A6A198UL)))
#define bM4_DMA2_RPTB3_SRPTB7                     (*((volatile unsigned int*)(0x42A6A19CUL)))
#define bM4_DMA2_RPTB3_SRPTB8                     (*((volatile unsigned int*)(0x42A6A1A0UL)))
#define bM4_DMA2_RPTB3_SRPTB9                     (*((volatile unsigned int*)(0x42A6A1A4UL)))
#define bM4_DMA2_RPTB3_DRPTB0                     (*((volatile unsigned int*)(0x42A6A1C0UL)))
#define bM4_DMA2_RPTB3_DRPTB1                     (*((volatile unsigned int*)(0x42A6A1C4UL)))
#define bM4_DMA2_RPTB3_DRPTB2                     (*((volatile unsigned int*)(0x42A6A1C8UL)))
#define bM4_DMA2_RPTB3_DRPTB3                     (*((volatile unsigned int*)(0x42A6A1CCUL)))
#define bM4_DMA2_RPTB3_DRPTB4                     (*((volatile unsigned int*)(0x42A6A1D0UL)))
#define bM4_DMA2_RPTB3_DRPTB5                     (*((volatile unsigned int*)(0x42A6A1D4UL)))
#define bM4_DMA2_RPTB3_DRPTB6                     (*((volatile unsigned int*)(0x42A6A1D8UL)))
#define bM4_DMA2_RPTB3_DRPTB7                     (*((volatile unsigned int*)(0x42A6A1DCUL)))
#define bM4_DMA2_RPTB3_DRPTB8                     (*((volatile unsigned int*)(0x42A6A1E0UL)))
#define bM4_DMA2_RPTB3_DRPTB9                     (*((volatile unsigned int*)(0x42A6A1E4UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET0               (*((volatile unsigned int*)(0x42A6A200UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET1               (*((volatile unsigned int*)(0x42A6A204UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET2               (*((volatile unsigned int*)(0x42A6A208UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET3               (*((volatile unsigned int*)(0x42A6A20CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET4               (*((volatile unsigned int*)(0x42A6A210UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET5               (*((volatile unsigned int*)(0x42A6A214UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET6               (*((volatile unsigned int*)(0x42A6A218UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET7               (*((volatile unsigned int*)(0x42A6A21CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET8               (*((volatile unsigned int*)(0x42A6A220UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET9               (*((volatile unsigned int*)(0x42A6A224UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET10              (*((volatile unsigned int*)(0x42A6A228UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET11              (*((volatile unsigned int*)(0x42A6A22CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET12              (*((volatile unsigned int*)(0x42A6A230UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET13              (*((volatile unsigned int*)(0x42A6A234UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET14              (*((volatile unsigned int*)(0x42A6A238UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET15              (*((volatile unsigned int*)(0x42A6A23CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET16              (*((volatile unsigned int*)(0x42A6A240UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET17              (*((volatile unsigned int*)(0x42A6A244UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET18              (*((volatile unsigned int*)(0x42A6A248UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET19              (*((volatile unsigned int*)(0x42A6A24CUL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT0                (*((volatile unsigned int*)(0x42A6A250UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT1                (*((volatile unsigned int*)(0x42A6A254UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT2                (*((volatile unsigned int*)(0x42A6A258UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT3                (*((volatile unsigned int*)(0x42A6A25CUL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT4                (*((volatile unsigned int*)(0x42A6A260UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT5                (*((volatile unsigned int*)(0x42A6A264UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT6                (*((volatile unsigned int*)(0x42A6A268UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT7                (*((volatile unsigned int*)(0x42A6A26CUL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT8                (*((volatile unsigned int*)(0x42A6A270UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT9                (*((volatile unsigned int*)(0x42A6A274UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT10               (*((volatile unsigned int*)(0x42A6A278UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT11               (*((volatile unsigned int*)(0x42A6A27CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST0              (*((volatile unsigned int*)(0x42A6A200UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST1              (*((volatile unsigned int*)(0x42A6A204UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST2              (*((volatile unsigned int*)(0x42A6A208UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST3              (*((volatile unsigned int*)(0x42A6A20CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST4              (*((volatile unsigned int*)(0x42A6A210UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST5              (*((volatile unsigned int*)(0x42A6A214UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST6              (*((volatile unsigned int*)(0x42A6A218UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST7              (*((volatile unsigned int*)(0x42A6A21CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST8              (*((volatile unsigned int*)(0x42A6A220UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST9              (*((volatile unsigned int*)(0x42A6A224UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST10             (*((volatile unsigned int*)(0x42A6A228UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST11             (*((volatile unsigned int*)(0x42A6A22CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST12             (*((volatile unsigned int*)(0x42A6A230UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST13             (*((volatile unsigned int*)(0x42A6A234UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST14             (*((volatile unsigned int*)(0x42A6A238UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST15             (*((volatile unsigned int*)(0x42A6A23CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST16             (*((volatile unsigned int*)(0x42A6A240UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST17             (*((volatile unsigned int*)(0x42A6A244UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST18             (*((volatile unsigned int*)(0x42A6A248UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSDIST19             (*((volatile unsigned int*)(0x42A6A24CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB0              (*((volatile unsigned int*)(0x42A6A250UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB1              (*((volatile unsigned int*)(0x42A6A254UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB2              (*((volatile unsigned int*)(0x42A6A258UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB3              (*((volatile unsigned int*)(0x42A6A25CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB4              (*((volatile unsigned int*)(0x42A6A260UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB5              (*((volatile unsigned int*)(0x42A6A264UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB6              (*((volatile unsigned int*)(0x42A6A268UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB7              (*((volatile unsigned int*)(0x42A6A26CUL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB8              (*((volatile unsigned int*)(0x42A6A270UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB9              (*((volatile unsigned int*)(0x42A6A274UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB10             (*((volatile unsigned int*)(0x42A6A278UL)))
#define bM4_DMA2_SNSEQCTLB3_SNSCNTB11             (*((volatile unsigned int*)(0x42A6A27CUL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET0               (*((volatile unsigned int*)(0x42A6A280UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET1               (*((volatile unsigned int*)(0x42A6A284UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET2               (*((volatile unsigned int*)(0x42A6A288UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET3               (*((volatile unsigned int*)(0x42A6A28CUL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET4               (*((volatile unsigned int*)(0x42A6A290UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET5               (*((volatile unsigned int*)(0x42A6A294UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET6               (*((volatile unsigned int*)(0x42A6A298UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET7               (*((volatile unsigned int*)(0x42A6A29CUL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET8               (*((volatile unsigned int*)(0x42A6A2A0UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET9               (*((volatile unsigned int*)(0x42A6A2A4UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET10              (*((volatile unsigned int*)(0x42A6A2A8UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET11              (*((volatile unsigned int*)(0x42A6A2ACUL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET12              (*((volatile unsigned int*)(0x42A6A2B0UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET13              (*((volatile unsigned int*)(0x42A6A2B4UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET14              (*((volatile unsigned int*)(0x42A6A2B8UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET15              (*((volatile unsigned int*)(0x42A6A2BCUL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET16              (*((volatile unsigned int*)(0x42A6A2C0UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET17              (*((volatile unsigned int*)(0x42A6A2C4UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET18              (*((volatile unsigned int*)(0x42A6A2C8UL)))
#define bM4_DMA2_DNSEQCTL3_DOFFSET19              (*((volatile unsigned int*)(0x42A6A2CCUL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT0                (*((volatile unsigned int*)(0x42A6A2D0UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT1                (*((volatile unsigned int*)(0x42A6A2D4UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT2                (*((volatile unsigned int*)(0x42A6A2D8UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT3                (*((volatile unsigned int*)(0x42A6A2DCUL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT4                (*((volatile unsigned int*)(0x42A6A2E0UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT5                (*((volatile unsigned int*)(0x42A6A2E4UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT6                (*((volatile unsigned int*)(0x42A6A2E8UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT7                (*((volatile unsigned int*)(0x42A6A2ECUL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT8                (*((volatile unsigned int*)(0x42A6A2F0UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT9                (*((volatile unsigned int*)(0x42A6A2F4UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT10               (*((volatile unsigned int*)(0x42A6A2F8UL)))
#define bM4_DMA2_DNSEQCTL3_DNSCNT11               (*((volatile unsigned int*)(0x42A6A2FCUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST0              (*((volatile unsigned int*)(0x42A6A280UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST1              (*((volatile unsigned int*)(0x42A6A284UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST2              (*((volatile unsigned int*)(0x42A6A288UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST3              (*((volatile unsigned int*)(0x42A6A28CUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST4              (*((volatile unsigned int*)(0x42A6A290UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST5              (*((volatile unsigned int*)(0x42A6A294UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST6              (*((volatile unsigned int*)(0x42A6A298UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST7              (*((volatile unsigned int*)(0x42A6A29CUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST8              (*((volatile unsigned int*)(0x42A6A2A0UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST9              (*((volatile unsigned int*)(0x42A6A2A4UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST10             (*((volatile unsigned int*)(0x42A6A2A8UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST11             (*((volatile unsigned int*)(0x42A6A2ACUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST12             (*((volatile unsigned int*)(0x42A6A2B0UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST13             (*((volatile unsigned int*)(0x42A6A2B4UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST14             (*((volatile unsigned int*)(0x42A6A2B8UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST15             (*((volatile unsigned int*)(0x42A6A2BCUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST16             (*((volatile unsigned int*)(0x42A6A2C0UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST17             (*((volatile unsigned int*)(0x42A6A2C4UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST18             (*((volatile unsigned int*)(0x42A6A2C8UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSDIST19             (*((volatile unsigned int*)(0x42A6A2CCUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB0              (*((volatile unsigned int*)(0x42A6A2D0UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB1              (*((volatile unsigned int*)(0x42A6A2D4UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB2              (*((volatile unsigned int*)(0x42A6A2D8UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB3              (*((volatile unsigned int*)(0x42A6A2DCUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB4              (*((volatile unsigned int*)(0x42A6A2E0UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB5              (*((volatile unsigned int*)(0x42A6A2E4UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB6              (*((volatile unsigned int*)(0x42A6A2E8UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB7              (*((volatile unsigned int*)(0x42A6A2ECUL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB8              (*((volatile unsigned int*)(0x42A6A2F0UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB9              (*((volatile unsigned int*)(0x42A6A2F4UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB10             (*((volatile unsigned int*)(0x42A6A2F8UL)))
#define bM4_DMA2_DNSEQCTLB3_DNSCNTB11             (*((volatile unsigned int*)(0x42A6A2FCUL)))
#define bM4_DMA2_LLP3_LLP0                        (*((volatile unsigned int*)(0x42A6A308UL)))
#define bM4_DMA2_LLP3_LLP1                        (*((volatile unsigned int*)(0x42A6A30CUL)))
#define bM4_DMA2_LLP3_LLP2                        (*((volatile unsigned int*)(0x42A6A310UL)))
#define bM4_DMA2_LLP3_LLP3                        (*((volatile unsigned int*)(0x42A6A314UL)))
#define bM4_DMA2_LLP3_LLP4                        (*((volatile unsigned int*)(0x42A6A318UL)))
#define bM4_DMA2_LLP3_LLP5                        (*((volatile unsigned int*)(0x42A6A31CUL)))
#define bM4_DMA2_LLP3_LLP6                        (*((volatile unsigned int*)(0x42A6A320UL)))
#define bM4_DMA2_LLP3_LLP7                        (*((volatile unsigned int*)(0x42A6A324UL)))
#define bM4_DMA2_LLP3_LLP8                        (*((volatile unsigned int*)(0x42A6A328UL)))
#define bM4_DMA2_LLP3_LLP9                        (*((volatile unsigned int*)(0x42A6A32CUL)))
#define bM4_DMA2_LLP3_LLP10                       (*((volatile unsigned int*)(0x42A6A330UL)))
#define bM4_DMA2_LLP3_LLP11                       (*((volatile unsigned int*)(0x42A6A334UL)))
#define bM4_DMA2_LLP3_LLP12                       (*((volatile unsigned int*)(0x42A6A338UL)))
#define bM4_DMA2_LLP3_LLP13                       (*((volatile unsigned int*)(0x42A6A33CUL)))
#define bM4_DMA2_LLP3_LLP14                       (*((volatile unsigned int*)(0x42A6A340UL)))
#define bM4_DMA2_LLP3_LLP15                       (*((volatile unsigned int*)(0x42A6A344UL)))
#define bM4_DMA2_LLP3_LLP16                       (*((volatile unsigned int*)(0x42A6A348UL)))
#define bM4_DMA2_LLP3_LLP17                       (*((volatile unsigned int*)(0x42A6A34CUL)))
#define bM4_DMA2_LLP3_LLP18                       (*((volatile unsigned int*)(0x42A6A350UL)))
#define bM4_DMA2_LLP3_LLP19                       (*((volatile unsigned int*)(0x42A6A354UL)))
#define bM4_DMA2_LLP3_LLP20                       (*((volatile unsigned int*)(0x42A6A358UL)))
#define bM4_DMA2_LLP3_LLP21                       (*((volatile unsigned int*)(0x42A6A35CUL)))
#define bM4_DMA2_LLP3_LLP22                       (*((volatile unsigned int*)(0x42A6A360UL)))
#define bM4_DMA2_LLP3_LLP23                       (*((volatile unsigned int*)(0x42A6A364UL)))
#define bM4_DMA2_LLP3_LLP24                       (*((volatile unsigned int*)(0x42A6A368UL)))
#define bM4_DMA2_LLP3_LLP25                       (*((volatile unsigned int*)(0x42A6A36CUL)))
#define bM4_DMA2_LLP3_LLP26                       (*((volatile unsigned int*)(0x42A6A370UL)))
#define bM4_DMA2_LLP3_LLP27                       (*((volatile unsigned int*)(0x42A6A374UL)))
#define bM4_DMA2_LLP3_LLP28                       (*((volatile unsigned int*)(0x42A6A378UL)))
#define bM4_DMA2_LLP3_LLP29                       (*((volatile unsigned int*)(0x42A6A37CUL)))
#define bM4_DMA2_CH3CTL_SINC0                     (*((volatile unsigned int*)(0x42A6A380UL)))
#define bM4_DMA2_CH3CTL_SINC1                     (*((volatile unsigned int*)(0x42A6A384UL)))
#define bM4_DMA2_CH3CTL_DINC0                     (*((volatile unsigned int*)(0x42A6A388UL)))
#define bM4_DMA2_CH3CTL_DINC1                     (*((volatile unsigned int*)(0x42A6A38CUL)))
#define bM4_DMA2_CH3CTL_SRPTEN                    (*((volatile unsigned int*)(0x42A6A390UL)))
#define bM4_DMA2_CH3CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A6A394UL)))
#define bM4_DMA2_CH3CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A6A398UL)))
#define bM4_DMA2_CH3CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A6A39CUL)))
#define bM4_DMA2_CH3CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A6A3A0UL)))
#define bM4_DMA2_CH3CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A6A3A4UL)))
#define bM4_DMA2_CH3CTL_LLPEN                     (*((volatile unsigned int*)(0x42A6A3A8UL)))
#define bM4_DMA2_CH3CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A6A3ACUL)))
#define bM4_DMA2_CH3CTL_IE                        (*((volatile unsigned int*)(0x42A6A3B0UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE0               (*((volatile unsigned int*)(0x42A6A500UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE1               (*((volatile unsigned int*)(0x42A6A504UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE2               (*((volatile unsigned int*)(0x42A6A508UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE3               (*((volatile unsigned int*)(0x42A6A50CUL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE4               (*((volatile unsigned int*)(0x42A6A510UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE5               (*((volatile unsigned int*)(0x42A6A514UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE6               (*((volatile unsigned int*)(0x42A6A518UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE7               (*((volatile unsigned int*)(0x42A6A51CUL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE8               (*((volatile unsigned int*)(0x42A6A520UL)))
#define bM4_DMA2_MONDTCTL3_BLKSIZE9               (*((volatile unsigned int*)(0x42A6A524UL)))
#define bM4_DMA2_MONDTCTL3_CNT0                   (*((volatile unsigned int*)(0x42A6A540UL)))
#define bM4_DMA2_MONDTCTL3_CNT1                   (*((volatile unsigned int*)(0x42A6A544UL)))
#define bM4_DMA2_MONDTCTL3_CNT2                   (*((volatile unsigned int*)(0x42A6A548UL)))
#define bM4_DMA2_MONDTCTL3_CNT3                   (*((volatile unsigned int*)(0x42A6A54CUL)))
#define bM4_DMA2_MONDTCTL3_CNT4                   (*((volatile unsigned int*)(0x42A6A550UL)))
#define bM4_DMA2_MONDTCTL3_CNT5                   (*((volatile unsigned int*)(0x42A6A554UL)))
