thtfcccj/CMSIS/hc32f46xb.h
#define bM4_DMA2_MONDTCTL3_CNT6                   (*((volatile unsigned int*)(0x42A6A558UL)))
#define bM4_DMA2_MONDTCTL3_CNT7                   (*((volatile unsigned int*)(0x42A6A55CUL)))
#define bM4_DMA2_MONDTCTL3_CNT8                   (*((volatile unsigned int*)(0x42A6A560UL)))
#define bM4_DMA2_MONDTCTL3_CNT9                   (*((volatile unsigned int*)(0x42A6A564UL)))
#define bM4_DMA2_MONDTCTL3_CNT10                  (*((volatile unsigned int*)(0x42A6A568UL)))
#define bM4_DMA2_MONDTCTL3_CNT11                  (*((volatile unsigned int*)(0x42A6A56CUL)))
#define bM4_DMA2_MONDTCTL3_CNT12                  (*((volatile unsigned int*)(0x42A6A570UL)))
#define bM4_DMA2_MONDTCTL3_CNT13                  (*((volatile unsigned int*)(0x42A6A574UL)))
#define bM4_DMA2_MONDTCTL3_CNT14                  (*((volatile unsigned int*)(0x42A6A578UL)))
#define bM4_DMA2_MONDTCTL3_CNT15                  (*((volatile unsigned int*)(0x42A6A57CUL)))
#define bM4_DMA2_MONRPT3_SRPT0                    (*((volatile unsigned int*)(0x42A6A580UL)))
#define bM4_DMA2_MONRPT3_SRPT1                    (*((volatile unsigned int*)(0x42A6A584UL)))
#define bM4_DMA2_MONRPT3_SRPT2                    (*((volatile unsigned int*)(0x42A6A588UL)))
#define bM4_DMA2_MONRPT3_SRPT3                    (*((volatile unsigned int*)(0x42A6A58CUL)))
#define bM4_DMA2_MONRPT3_SRPT4                    (*((volatile unsigned int*)(0x42A6A590UL)))
#define bM4_DMA2_MONRPT3_SRPT5                    (*((volatile unsigned int*)(0x42A6A594UL)))
#define bM4_DMA2_MONRPT3_SRPT6                    (*((volatile unsigned int*)(0x42A6A598UL)))
#define bM4_DMA2_MONRPT3_SRPT7                    (*((volatile unsigned int*)(0x42A6A59CUL)))
#define bM4_DMA2_MONRPT3_SRPT8                    (*((volatile unsigned int*)(0x42A6A5A0UL)))
#define bM4_DMA2_MONRPT3_SRPT9                    (*((volatile unsigned int*)(0x42A6A5A4UL)))
#define bM4_DMA2_MONRPT3_DRPT0                    (*((volatile unsigned int*)(0x42A6A5C0UL)))
#define bM4_DMA2_MONRPT3_DRPT1                    (*((volatile unsigned int*)(0x42A6A5C4UL)))
#define bM4_DMA2_MONRPT3_DRPT2                    (*((volatile unsigned int*)(0x42A6A5C8UL)))
#define bM4_DMA2_MONRPT3_DRPT3                    (*((volatile unsigned int*)(0x42A6A5CCUL)))
#define bM4_DMA2_MONRPT3_DRPT4                    (*((volatile unsigned int*)(0x42A6A5D0UL)))
#define bM4_DMA2_MONRPT3_DRPT5                    (*((volatile unsigned int*)(0x42A6A5D4UL)))
#define bM4_DMA2_MONRPT3_DRPT6                    (*((volatile unsigned int*)(0x42A6A5D8UL)))
#define bM4_DMA2_MONRPT3_DRPT7                    (*((volatile unsigned int*)(0x42A6A5DCUL)))
#define bM4_DMA2_MONRPT3_DRPT8                    (*((volatile unsigned int*)(0x42A6A5E0UL)))
#define bM4_DMA2_MONRPT3_DRPT9                    (*((volatile unsigned int*)(0x42A6A5E4UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET0            (*((volatile unsigned int*)(0x42A6A600UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET1            (*((volatile unsigned int*)(0x42A6A604UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET2            (*((volatile unsigned int*)(0x42A6A608UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET3            (*((volatile unsigned int*)(0x42A6A60CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET4            (*((volatile unsigned int*)(0x42A6A610UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET5            (*((volatile unsigned int*)(0x42A6A614UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET6            (*((volatile unsigned int*)(0x42A6A618UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET7            (*((volatile unsigned int*)(0x42A6A61CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET8            (*((volatile unsigned int*)(0x42A6A620UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET9            (*((volatile unsigned int*)(0x42A6A624UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET10           (*((volatile unsigned int*)(0x42A6A628UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET11           (*((volatile unsigned int*)(0x42A6A62CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET12           (*((volatile unsigned int*)(0x42A6A630UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET13           (*((volatile unsigned int*)(0x42A6A634UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET14           (*((volatile unsigned int*)(0x42A6A638UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET15           (*((volatile unsigned int*)(0x42A6A63CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET16           (*((volatile unsigned int*)(0x42A6A640UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET17           (*((volatile unsigned int*)(0x42A6A644UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET18           (*((volatile unsigned int*)(0x42A6A648UL)))
#define bM4_DMA2_MONSNSEQCTL3_SOFFSET19           (*((volatile unsigned int*)(0x42A6A64CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT0             (*((volatile unsigned int*)(0x42A6A650UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT1             (*((volatile unsigned int*)(0x42A6A654UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT2             (*((volatile unsigned int*)(0x42A6A658UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT3             (*((volatile unsigned int*)(0x42A6A65CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT4             (*((volatile unsigned int*)(0x42A6A660UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT5             (*((volatile unsigned int*)(0x42A6A664UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT6             (*((volatile unsigned int*)(0x42A6A668UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT7             (*((volatile unsigned int*)(0x42A6A66CUL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT8             (*((volatile unsigned int*)(0x42A6A670UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT9             (*((volatile unsigned int*)(0x42A6A674UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT10            (*((volatile unsigned int*)(0x42A6A678UL)))
#define bM4_DMA2_MONSNSEQCTL3_SNSCNT11            (*((volatile unsigned int*)(0x42A6A67CUL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET0            (*((volatile unsigned int*)(0x42A6A680UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET1            (*((volatile unsigned int*)(0x42A6A684UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET2            (*((volatile unsigned int*)(0x42A6A688UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET3            (*((volatile unsigned int*)(0x42A6A68CUL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET4            (*((volatile unsigned int*)(0x42A6A690UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET5            (*((volatile unsigned int*)(0x42A6A694UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET6            (*((volatile unsigned int*)(0x42A6A698UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET7            (*((volatile unsigned int*)(0x42A6A69CUL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET8            (*((volatile unsigned int*)(0x42A6A6A0UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET9            (*((volatile unsigned int*)(0x42A6A6A4UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET10           (*((volatile unsigned int*)(0x42A6A6A8UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET11           (*((volatile unsigned int*)(0x42A6A6ACUL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET12           (*((volatile unsigned int*)(0x42A6A6B0UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET13           (*((volatile unsigned int*)(0x42A6A6B4UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET14           (*((volatile unsigned int*)(0x42A6A6B8UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET15           (*((volatile unsigned int*)(0x42A6A6BCUL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET16           (*((volatile unsigned int*)(0x42A6A6C0UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET17           (*((volatile unsigned int*)(0x42A6A6C4UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET18           (*((volatile unsigned int*)(0x42A6A6C8UL)))
#define bM4_DMA2_MONDNSEQCTL3_DOFFSET19           (*((volatile unsigned int*)(0x42A6A6CCUL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT0             (*((volatile unsigned int*)(0x42A6A6D0UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT1             (*((volatile unsigned int*)(0x42A6A6D4UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT2             (*((volatile unsigned int*)(0x42A6A6D8UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT3             (*((volatile unsigned int*)(0x42A6A6DCUL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT4             (*((volatile unsigned int*)(0x42A6A6E0UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT5             (*((volatile unsigned int*)(0x42A6A6E4UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT6             (*((volatile unsigned int*)(0x42A6A6E8UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT7             (*((volatile unsigned int*)(0x42A6A6ECUL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT8             (*((volatile unsigned int*)(0x42A6A6F0UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT9             (*((volatile unsigned int*)(0x42A6A6F4UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT10            (*((volatile unsigned int*)(0x42A6A6F8UL)))
#define bM4_DMA2_MONDNSEQCTL3_DNSCNT11            (*((volatile unsigned int*)(0x42A6A6FCUL)))
#define bM4_EFM_FAPRT_FAPRT0                      (*((volatile unsigned int*)(0x42208000UL)))
#define bM4_EFM_FAPRT_FAPRT1                      (*((volatile unsigned int*)(0x42208004UL)))
#define bM4_EFM_FAPRT_FAPRT2                      (*((volatile unsigned int*)(0x42208008UL)))
#define bM4_EFM_FAPRT_FAPRT3                      (*((volatile unsigned int*)(0x4220800CUL)))
#define bM4_EFM_FAPRT_FAPRT4                      (*((volatile unsigned int*)(0x42208010UL)))
#define bM4_EFM_FAPRT_FAPRT5                      (*((volatile unsigned int*)(0x42208014UL)))
#define bM4_EFM_FAPRT_FAPRT6                      (*((volatile unsigned int*)(0x42208018UL)))
#define bM4_EFM_FAPRT_FAPRT7                      (*((volatile unsigned int*)(0x4220801CUL)))
#define bM4_EFM_FAPRT_FAPRT8                      (*((volatile unsigned int*)(0x42208020UL)))
#define bM4_EFM_FAPRT_FAPRT9                      (*((volatile unsigned int*)(0x42208024UL)))
#define bM4_EFM_FAPRT_FAPRT10                     (*((volatile unsigned int*)(0x42208028UL)))
#define bM4_EFM_FAPRT_FAPRT11                     (*((volatile unsigned int*)(0x4220802CUL)))
#define bM4_EFM_FAPRT_FAPRT12                     (*((volatile unsigned int*)(0x42208030UL)))
#define bM4_EFM_FAPRT_FAPRT13                     (*((volatile unsigned int*)(0x42208034UL)))
#define bM4_EFM_FAPRT_FAPRT14                     (*((volatile unsigned int*)(0x42208038UL)))
#define bM4_EFM_FAPRT_FAPRT15                     (*((volatile unsigned int*)(0x4220803CUL)))
#define bM4_EFM_FSTP_FSTP                         (*((volatile unsigned int*)(0x42208080UL)))
#define bM4_EFM_FRMC_SLPMD                        (*((volatile unsigned int*)(0x42208100UL)))
#define bM4_EFM_FRMC_FLWT0                        (*((volatile unsigned int*)(0x42208110UL)))
#define bM4_EFM_FRMC_FLWT1                        (*((volatile unsigned int*)(0x42208114UL)))
#define bM4_EFM_FRMC_FLWT2                        (*((volatile unsigned int*)(0x42208118UL)))
#define bM4_EFM_FRMC_FLWT3                        (*((volatile unsigned int*)(0x4220811CUL)))
#define bM4_EFM_FRMC_LVM                          (*((volatile unsigned int*)(0x42208120UL)))
#define bM4_EFM_FRMC_CACHE                        (*((volatile unsigned int*)(0x42208140UL)))
#define bM4_EFM_FRMC_CRST                         (*((volatile unsigned int*)(0x42208160UL)))
#define bM4_EFM_FWMC_PEMODE                       (*((volatile unsigned int*)(0x42208180UL)))
#define bM4_EFM_FWMC_PEMOD0                       (*((volatile unsigned int*)(0x42208190UL)))
#define bM4_EFM_FWMC_PEMOD1                       (*((volatile unsigned int*)(0x42208194UL)))
#define bM4_EFM_FWMC_PEMOD2                       (*((volatile unsigned int*)(0x42208198UL)))
#define bM4_EFM_FWMC_BUSHLDCTL                    (*((volatile unsigned int*)(0x422081A0UL)))
#define bM4_EFM_FSR_PEWERR                        (*((volatile unsigned int*)(0x42208200UL)))
#define bM4_EFM_FSR_PEPRTERR                      (*((volatile unsigned int*)(0x42208204UL)))
#define bM4_EFM_FSR_PGSZERR                       (*((volatile unsigned int*)(0x42208208UL)))
#define bM4_EFM_FSR_PGMISMTCH                     (*((volatile unsigned int*)(0x4220820CUL)))
#define bM4_EFM_FSR_OPTEND                        (*((volatile unsigned int*)(0x42208210UL)))
#define bM4_EFM_FSR_COLERR                        (*((volatile unsigned int*)(0x42208214UL)))
#define bM4_EFM_FSR_RDY                           (*((volatile unsigned int*)(0x42208220UL)))
#define bM4_EFM_FSCLR_PEWERRCLR                   (*((volatile unsigned int*)(0x42208280UL)))
#define bM4_EFM_FSCLR_PEPRTERRCLR                 (*((volatile unsigned int*)(0x42208284UL)))
#define bM4_EFM_FSCLR_PGSZERRCLR                  (*((volatile unsigned int*)(0x42208288UL)))
#define bM4_EFM_FSCLR_PGMISMTCHCLR                (*((volatile unsigned int*)(0x4220828CUL)))
#define bM4_EFM_FSCLR_OPTENDCLR                   (*((volatile unsigned int*)(0x42208290UL)))
#define bM4_EFM_FSCLR_COLERRCLR                   (*((volatile unsigned int*)(0x42208294UL)))
#define bM4_EFM_FITE_PEERRITE                     (*((volatile unsigned int*)(0x42208300UL)))
#define bM4_EFM_FITE_OPTENDITE                    (*((volatile unsigned int*)(0x42208304UL)))
#define bM4_EFM_FITE_COLERRITE                    (*((volatile unsigned int*)(0x42208308UL)))
#define bM4_EFM_FSWP_FSWP                         (*((volatile unsigned int*)(0x42208380UL)))
#define bM4_EFM_FPMTSW_FPMTSW0                    (*((volatile unsigned int*)(0x42208400UL)))
#define bM4_EFM_FPMTSW_FPMTSW1                    (*((volatile unsigned int*)(0x42208404UL)))
#define bM4_EFM_FPMTSW_FPMTSW2                    (*((volatile unsigned int*)(0x42208408UL)))
#define bM4_EFM_FPMTSW_FPMTSW3                    (*((volatile unsigned int*)(0x4220840CUL)))
#define bM4_EFM_FPMTSW_FPMTSW4                    (*((volatile unsigned int*)(0x42208410UL)))
#define bM4_EFM_FPMTSW_FPMTSW5                    (*((volatile unsigned int*)(0x42208414UL)))
#define bM4_EFM_FPMTSW_FPMTSW6                    (*((volatile unsigned int*)(0x42208418UL)))
#define bM4_EFM_FPMTSW_FPMTSW7                    (*((volatile unsigned int*)(0x4220841CUL)))
#define bM4_EFM_FPMTSW_FPMTSW8                    (*((volatile unsigned int*)(0x42208420UL)))
#define bM4_EFM_FPMTSW_FPMTSW9                    (*((volatile unsigned int*)(0x42208424UL)))
#define bM4_EFM_FPMTSW_FPMTSW10                   (*((volatile unsigned int*)(0x42208428UL)))
#define bM4_EFM_FPMTSW_FPMTSW11                   (*((volatile unsigned int*)(0x4220842CUL)))
#define bM4_EFM_FPMTSW_FPMTSW12                   (*((volatile unsigned int*)(0x42208430UL)))
#define bM4_EFM_FPMTSW_FPMTSW13                   (*((volatile unsigned int*)(0x42208434UL)))
#define bM4_EFM_FPMTSW_FPMTSW14                   (*((volatile unsigned int*)(0x42208438UL)))
#define bM4_EFM_FPMTSW_FPMTSW15                   (*((volatile unsigned int*)(0x4220843CUL)))
#define bM4_EFM_FPMTSW_FPMTSW16                   (*((volatile unsigned int*)(0x42208440UL)))
#define bM4_EFM_FPMTSW_FPMTSW17                   (*((volatile unsigned int*)(0x42208444UL)))
#define bM4_EFM_FPMTSW_FPMTSW18                   (*((volatile unsigned int*)(0x42208448UL)))
#define bM4_EFM_FPMTEW_FPMTEW0                    (*((volatile unsigned int*)(0x42208480UL)))
#define bM4_EFM_FPMTEW_FPMTEW1                    (*((volatile unsigned int*)(0x42208484UL)))
#define bM4_EFM_FPMTEW_FPMTEW2                    (*((volatile unsigned int*)(0x42208488UL)))
#define bM4_EFM_FPMTEW_FPMTEW3                    (*((volatile unsigned int*)(0x4220848CUL)))
#define bM4_EFM_FPMTEW_FPMTEW4                    (*((volatile unsigned int*)(0x42208490UL)))
#define bM4_EFM_FPMTEW_FPMTEW5                    (*((volatile unsigned int*)(0x42208494UL)))
#define bM4_EFM_FPMTEW_FPMTEW6                    (*((volatile unsigned int*)(0x42208498UL)))
#define bM4_EFM_FPMTEW_FPMTEW7                    (*((volatile unsigned int*)(0x4220849CUL)))
#define bM4_EFM_FPMTEW_FPMTEW8                    (*((volatile unsigned int*)(0x422084A0UL)))
#define bM4_EFM_FPMTEW_FPMTEW9                    (*((volatile unsigned int*)(0x422084A4UL)))
#define bM4_EFM_FPMTEW_FPMTEW10                   (*((volatile unsigned int*)(0x422084A8UL)))
#define bM4_EFM_FPMTEW_FPMTEW11                   (*((volatile unsigned int*)(0x422084ACUL)))
#define bM4_EFM_FPMTEW_FPMTEW12                   (*((volatile unsigned int*)(0x422084B0UL)))
#define bM4_EFM_FPMTEW_FPMTEW13                   (*((volatile unsigned int*)(0x422084B4UL)))
#define bM4_EFM_FPMTEW_FPMTEW14                   (*((volatile unsigned int*)(0x422084B8UL)))
#define bM4_EFM_FPMTEW_FPMTEW15                   (*((volatile unsigned int*)(0x422084BCUL)))
#define bM4_EFM_FPMTEW_FPMTEW16                   (*((volatile unsigned int*)(0x422084C0UL)))
#define bM4_EFM_FPMTEW_FPMTEW17                   (*((volatile unsigned int*)(0x422084C4UL)))
#define bM4_EFM_FPMTEW_FPMTEW18                   (*((volatile unsigned int*)(0x422084C8UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT0                (*((volatile unsigned int*)(0x4220A000UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT1                (*((volatile unsigned int*)(0x4220A004UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT2                (*((volatile unsigned int*)(0x4220A008UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT3                (*((volatile unsigned int*)(0x4220A00CUL)))
#define bM4_EFM_MMF_REMPRT_REMPRT4                (*((volatile unsigned int*)(0x4220A010UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT5                (*((volatile unsigned int*)(0x4220A014UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT6                (*((volatile unsigned int*)(0x4220A018UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT7                (*((volatile unsigned int*)(0x4220A01CUL)))
#define bM4_EFM_MMF_REMPRT_REMPRT8                (*((volatile unsigned int*)(0x4220A020UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT9                (*((volatile unsigned int*)(0x4220A024UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT10               (*((volatile unsigned int*)(0x4220A028UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT11               (*((volatile unsigned int*)(0x4220A02CUL)))
#define bM4_EFM_MMF_REMPRT_REMPRT12               (*((volatile unsigned int*)(0x4220A030UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT13               (*((volatile unsigned int*)(0x4220A034UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT14               (*((volatile unsigned int*)(0x4220A038UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT15               (*((volatile unsigned int*)(0x4220A03CUL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE0               (*((volatile unsigned int*)(0x4220A080UL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE1               (*((volatile unsigned int*)(0x4220A084UL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE2               (*((volatile unsigned int*)(0x4220A088UL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE3               (*((volatile unsigned int*)(0x4220A08CUL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE4               (*((volatile unsigned int*)(0x4220A090UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR0              (*((volatile unsigned int*)(0x4220A0B0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR1              (*((volatile unsigned int*)(0x4220A0B4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR2              (*((volatile unsigned int*)(0x4220A0B8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR3              (*((volatile unsigned int*)(0x4220A0BCUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR4              (*((volatile unsigned int*)(0x4220A0C0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR5              (*((volatile unsigned int*)(0x4220A0C4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR6              (*((volatile unsigned int*)(0x4220A0C8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR7              (*((volatile unsigned int*)(0x4220A0CCUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR8              (*((volatile unsigned int*)(0x4220A0D0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR9              (*((volatile unsigned int*)(0x4220A0D4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR10             (*((volatile unsigned int*)(0x4220A0D8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR11             (*((volatile unsigned int*)(0x4220A0DCUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR12             (*((volatile unsigned int*)(0x4220A0E0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR13             (*((volatile unsigned int*)(0x4220A0E4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR14             (*((volatile unsigned int*)(0x4220A0E8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR15             (*((volatile unsigned int*)(0x4220A0ECUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR16             (*((volatile unsigned int*)(0x4220A0F0UL)))
#define bM4_EFM_MMF_REMCR0_EN0                    (*((volatile unsigned int*)(0x4220A0FCUL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE0               (*((volatile unsigned int*)(0x4220A100UL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE1               (*((volatile unsigned int*)(0x4220A104UL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE2               (*((volatile unsigned int*)(0x4220A108UL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE3               (*((volatile unsigned int*)(0x4220A10CUL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE4               (*((volatile unsigned int*)(0x4220A110UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR0              (*((volatile unsigned int*)(0x4220A130UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR1              (*((volatile unsigned int*)(0x4220A134UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR2              (*((volatile unsigned int*)(0x4220A138UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR3              (*((volatile unsigned int*)(0x4220A13CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR4              (*((volatile unsigned int*)(0x4220A140UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR5              (*((volatile unsigned int*)(0x4220A144UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR6              (*((volatile unsigned int*)(0x4220A148UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR7              (*((volatile unsigned int*)(0x4220A14CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR8              (*((volatile unsigned int*)(0x4220A150UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR9              (*((volatile unsigned int*)(0x4220A154UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR10             (*((volatile unsigned int*)(0x4220A158UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR11             (*((volatile unsigned int*)(0x4220A15CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR12             (*((volatile unsigned int*)(0x4220A160UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR13             (*((volatile unsigned int*)(0x4220A164UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR14             (*((volatile unsigned int*)(0x4220A168UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR15             (*((volatile unsigned int*)(0x4220A16CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR16             (*((volatile unsigned int*)(0x4220A170UL)))
#define bM4_EFM_MMF_REMCR1_EN1                    (*((volatile unsigned int*)(0x4220A17CUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS0                (*((volatile unsigned int*)(0x4220C084UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS1                (*((volatile unsigned int*)(0x4220C088UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS2                (*((volatile unsigned int*)(0x4220C08CUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS3                (*((volatile unsigned int*)(0x4220C090UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS4                (*((volatile unsigned int*)(0x4220C094UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS5                (*((volatile unsigned int*)(0x4220C098UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS6                (*((volatile unsigned int*)(0x4220C09CUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS7                (*((volatile unsigned int*)(0x4220C0A0UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS8                (*((volatile unsigned int*)(0x4220C0A4UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS9                (*((volatile unsigned int*)(0x4220C0A8UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS10               (*((volatile unsigned int*)(0x4220C0ACUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS11               (*((volatile unsigned int*)(0x4220C0B0UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS12               (*((volatile unsigned int*)(0x4220C0B4UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS13               (*((volatile unsigned int*)(0x4220C0B8UL)))
