thtfcccj/CMSIS/hc32f46xb.h
#define bM4_I2S3_SR_RXBE                          (*((volatile unsigned int*)(0x42440090UL)))
#define bM4_I2S3_SR_RXBF                          (*((volatile unsigned int*)(0x42440094UL)))
#define bM4_I2S3_ER_TXERR                         (*((volatile unsigned int*)(0x42440100UL)))
#define bM4_I2S3_ER_RXERR                         (*((volatile unsigned int*)(0x42440104UL)))
#define bM4_I2S3_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x42440180UL)))
#define bM4_I2S3_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x42440184UL)))
#define bM4_I2S3_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x42440188UL)))
#define bM4_I2S3_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x4244018CUL)))
#define bM4_I2S3_CFGR_CHLEN                       (*((volatile unsigned int*)(0x42440190UL)))
#define bM4_I2S3_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x42440194UL)))
#define bM4_I2S3_PR_I2SDIV0                       (*((volatile unsigned int*)(0x42440300UL)))
#define bM4_I2S3_PR_I2SDIV1                       (*((volatile unsigned int*)(0x42440304UL)))
#define bM4_I2S3_PR_I2SDIV2                       (*((volatile unsigned int*)(0x42440308UL)))
#define bM4_I2S3_PR_I2SDIV3                       (*((volatile unsigned int*)(0x4244030CUL)))
#define bM4_I2S3_PR_I2SDIV4                       (*((volatile unsigned int*)(0x42440310UL)))
#define bM4_I2S3_PR_I2SDIV5                       (*((volatile unsigned int*)(0x42440314UL)))
#define bM4_I2S3_PR_I2SDIV6                       (*((volatile unsigned int*)(0x42440318UL)))
#define bM4_I2S3_PR_I2SDIV7                       (*((volatile unsigned int*)(0x4244031CUL)))
#define bM4_I2S4_CTRL_TXE                         (*((volatile unsigned int*)(0x42448000UL)))
#define bM4_I2S4_CTRL_TXIE                        (*((volatile unsigned int*)(0x42448004UL)))
#define bM4_I2S4_CTRL_RXE                         (*((volatile unsigned int*)(0x42448008UL)))
#define bM4_I2S4_CTRL_RXIE                        (*((volatile unsigned int*)(0x4244800CUL)))
#define bM4_I2S4_CTRL_EIE                         (*((volatile unsigned int*)(0x42448010UL)))
#define bM4_I2S4_CTRL_WMS                         (*((volatile unsigned int*)(0x42448014UL)))
#define bM4_I2S4_CTRL_ODD                         (*((volatile unsigned int*)(0x42448018UL)))
#define bM4_I2S4_CTRL_MCKOE                       (*((volatile unsigned int*)(0x4244801CUL)))
#define bM4_I2S4_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x42448020UL)))
#define bM4_I2S4_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x42448024UL)))
#define bM4_I2S4_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x42448028UL)))
#define bM4_I2S4_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x42448030UL)))
#define bM4_I2S4_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x42448034UL)))
#define bM4_I2S4_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x42448038UL)))
#define bM4_I2S4_CTRL_FIFOR                       (*((volatile unsigned int*)(0x42448040UL)))
#define bM4_I2S4_CTRL_CODECRC                     (*((volatile unsigned int*)(0x42448044UL)))
#define bM4_I2S4_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x42448048UL)))
#define bM4_I2S4_CTRL_SDOE                        (*((volatile unsigned int*)(0x4244804CUL)))
#define bM4_I2S4_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x42448050UL)))
#define bM4_I2S4_CTRL_CKOE                        (*((volatile unsigned int*)(0x42448054UL)))
#define bM4_I2S4_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x42448058UL)))
#define bM4_I2S4_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x4244805CUL)))
#define bM4_I2S4_SR_TXBA                          (*((volatile unsigned int*)(0x42448080UL)))
#define bM4_I2S4_SR_RXBA                          (*((volatile unsigned int*)(0x42448084UL)))
#define bM4_I2S4_SR_TXBE                          (*((volatile unsigned int*)(0x42448088UL)))
#define bM4_I2S4_SR_TXBF                          (*((volatile unsigned int*)(0x4244808CUL)))
#define bM4_I2S4_SR_RXBE                          (*((volatile unsigned int*)(0x42448090UL)))
#define bM4_I2S4_SR_RXBF                          (*((volatile unsigned int*)(0x42448094UL)))
#define bM4_I2S4_ER_TXERR                         (*((volatile unsigned int*)(0x42448100UL)))
#define bM4_I2S4_ER_RXERR                         (*((volatile unsigned int*)(0x42448104UL)))
#define bM4_I2S4_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x42448180UL)))
#define bM4_I2S4_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x42448184UL)))
#define bM4_I2S4_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x42448188UL)))
#define bM4_I2S4_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x4244818CUL)))
#define bM4_I2S4_CFGR_CHLEN                       (*((volatile unsigned int*)(0x42448190UL)))
#define bM4_I2S4_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x42448194UL)))
#define bM4_I2S4_PR_I2SDIV0                       (*((volatile unsigned int*)(0x42448300UL)))
#define bM4_I2S4_PR_I2SDIV1                       (*((volatile unsigned int*)(0x42448304UL)))
#define bM4_I2S4_PR_I2SDIV2                       (*((volatile unsigned int*)(0x42448308UL)))
#define bM4_I2S4_PR_I2SDIV3                       (*((volatile unsigned int*)(0x4244830CUL)))
#define bM4_I2S4_PR_I2SDIV4                       (*((volatile unsigned int*)(0x42448310UL)))
#define bM4_I2S4_PR_I2SDIV5                       (*((volatile unsigned int*)(0x42448314UL)))
#define bM4_I2S4_PR_I2SDIV6                       (*((volatile unsigned int*)(0x42448318UL)))
#define bM4_I2S4_PR_I2SDIV7                       (*((volatile unsigned int*)(0x4244831CUL)))
#define bM4_INTC_NMICR_NMITRG                     (*((volatile unsigned int*)(0x42A20000UL)))
#define bM4_INTC_NMICR_NSMPCLK0                   (*((volatile unsigned int*)(0x42A20010UL)))
#define bM4_INTC_NMICR_NSMPCLK1                   (*((volatile unsigned int*)(0x42A20014UL)))
#define bM4_INTC_NMICR_NFEN                       (*((volatile unsigned int*)(0x42A2001CUL)))
#define bM4_INTC_NMIENR_NMIENR                    (*((volatile unsigned int*)(0x42A20080UL)))
#define bM4_INTC_NMIENR_SWDTENR                   (*((volatile unsigned int*)(0x42A20084UL)))
#define bM4_INTC_NMIENR_PVD1ENR                   (*((volatile unsigned int*)(0x42A20088UL)))
#define bM4_INTC_NMIENR_PVD2ENR                   (*((volatile unsigned int*)(0x42A2008CUL)))
#define bM4_INTC_NMIENR_XTALSTPENR                (*((volatile unsigned int*)(0x42A20094UL)))
#define bM4_INTC_NMIENR_REPENR                    (*((volatile unsigned int*)(0x42A200A0UL)))
#define bM4_INTC_NMIENR_RECCENR                   (*((volatile unsigned int*)(0x42A200A4UL)))
#define bM4_INTC_NMIENR_BUSMENR                   (*((volatile unsigned int*)(0x42A200A8UL)))
#define bM4_INTC_NMIENR_WDTENR                    (*((volatile unsigned int*)(0x42A200ACUL)))
#define bM4_INTC_NMIFR_NMIFR                      (*((volatile unsigned int*)(0x42A20100UL)))
#define bM4_INTC_NMIFR_SWDTFR                     (*((volatile unsigned int*)(0x42A20104UL)))
#define bM4_INTC_NMIFR_PVD1FR                     (*((volatile unsigned int*)(0x42A20108UL)))
#define bM4_INTC_NMIFR_PVD2FR                     (*((volatile unsigned int*)(0x42A2010CUL)))
#define bM4_INTC_NMIFR_XTALSTPFR                  (*((volatile unsigned int*)(0x42A20114UL)))
#define bM4_INTC_NMIFR_REPFR                      (*((volatile unsigned int*)(0x42A20120UL)))
#define bM4_INTC_NMIFR_RECCFR                     (*((volatile unsigned int*)(0x42A20124UL)))
#define bM4_INTC_NMIFR_BUSMFR                     (*((volatile unsigned int*)(0x42A20128UL)))
#define bM4_INTC_NMIFR_WDTFR                      (*((volatile unsigned int*)(0x42A2012CUL)))
#define bM4_INTC_NMICFR_NMICFR                    (*((volatile unsigned int*)(0x42A20180UL)))
#define bM4_INTC_NMICFR_SWDTCFR                   (*((volatile unsigned int*)(0x42A20184UL)))
#define bM4_INTC_NMICFR_PVD1CFR                   (*((volatile unsigned int*)(0x42A20188UL)))
#define bM4_INTC_NMICFR_PVD2CFR                   (*((volatile unsigned int*)(0x42A2018CUL)))
#define bM4_INTC_NMICFR_XTALSTPCFR                (*((volatile unsigned int*)(0x42A20194UL)))
#define bM4_INTC_NMICFR_REPCFR                    (*((volatile unsigned int*)(0x42A201A0UL)))
#define bM4_INTC_NMICFR_RECCCFR                   (*((volatile unsigned int*)(0x42A201A4UL)))
#define bM4_INTC_NMICFR_BUSMCFR                   (*((volatile unsigned int*)(0x42A201A8UL)))
#define bM4_INTC_NMICFR_WDTCFR                    (*((volatile unsigned int*)(0x42A201ACUL)))
#define bM4_INTC_EIRQCR0_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20200UL)))
#define bM4_INTC_EIRQCR0_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20204UL)))
#define bM4_INTC_EIRQCR0_EISMPCLK0                (*((volatile unsigned int*)(0x42A20210UL)))
#define bM4_INTC_EIRQCR0_EISMPCLK1                (*((volatile unsigned int*)(0x42A20214UL)))
#define bM4_INTC_EIRQCR0_EFEN                     (*((volatile unsigned int*)(0x42A2021CUL)))
#define bM4_INTC_EIRQCR1_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20280UL)))
#define bM4_INTC_EIRQCR1_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20284UL)))
#define bM4_INTC_EIRQCR1_EISMPCLK0                (*((volatile unsigned int*)(0x42A20290UL)))
#define bM4_INTC_EIRQCR1_EISMPCLK1                (*((volatile unsigned int*)(0x42A20294UL)))
#define bM4_INTC_EIRQCR1_EFEN                     (*((volatile unsigned int*)(0x42A2029CUL)))
#define bM4_INTC_EIRQCR2_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20300UL)))
#define bM4_INTC_EIRQCR2_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20304UL)))
#define bM4_INTC_EIRQCR2_EISMPCLK0                (*((volatile unsigned int*)(0x42A20310UL)))
#define bM4_INTC_EIRQCR2_EISMPCLK1                (*((volatile unsigned int*)(0x42A20314UL)))
#define bM4_INTC_EIRQCR2_EFEN                     (*((volatile unsigned int*)(0x42A2031CUL)))
#define bM4_INTC_EIRQCR3_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20380UL)))
#define bM4_INTC_EIRQCR3_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20384UL)))
#define bM4_INTC_EIRQCR3_EISMPCLK0                (*((volatile unsigned int*)(0x42A20390UL)))
#define bM4_INTC_EIRQCR3_EISMPCLK1                (*((volatile unsigned int*)(0x42A20394UL)))
#define bM4_INTC_EIRQCR3_EFEN                     (*((volatile unsigned int*)(0x42A2039CUL)))
#define bM4_INTC_EIRQCR4_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20400UL)))
#define bM4_INTC_EIRQCR4_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20404UL)))
#define bM4_INTC_EIRQCR4_EISMPCLK0                (*((volatile unsigned int*)(0x42A20410UL)))
#define bM4_INTC_EIRQCR4_EISMPCLK1                (*((volatile unsigned int*)(0x42A20414UL)))
#define bM4_INTC_EIRQCR4_EFEN                     (*((volatile unsigned int*)(0x42A2041CUL)))
#define bM4_INTC_EIRQCR5_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20480UL)))
#define bM4_INTC_EIRQCR5_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20484UL)))
#define bM4_INTC_EIRQCR5_EISMPCLK0                (*((volatile unsigned int*)(0x42A20490UL)))
#define bM4_INTC_EIRQCR5_EISMPCLK1                (*((volatile unsigned int*)(0x42A20494UL)))
#define bM4_INTC_EIRQCR5_EFEN                     (*((volatile unsigned int*)(0x42A2049CUL)))
#define bM4_INTC_EIRQCR6_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20500UL)))
#define bM4_INTC_EIRQCR6_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20504UL)))
#define bM4_INTC_EIRQCR6_EISMPCLK0                (*((volatile unsigned int*)(0x42A20510UL)))
#define bM4_INTC_EIRQCR6_EISMPCLK1                (*((volatile unsigned int*)(0x42A20514UL)))
#define bM4_INTC_EIRQCR6_EFEN                     (*((volatile unsigned int*)(0x42A2051CUL)))
#define bM4_INTC_EIRQCR7_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20580UL)))
#define bM4_INTC_EIRQCR7_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20584UL)))
#define bM4_INTC_EIRQCR7_EISMPCLK0                (*((volatile unsigned int*)(0x42A20590UL)))
#define bM4_INTC_EIRQCR7_EISMPCLK1                (*((volatile unsigned int*)(0x42A20594UL)))
#define bM4_INTC_EIRQCR7_EFEN                     (*((volatile unsigned int*)(0x42A2059CUL)))
#define bM4_INTC_EIRQCR8_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20600UL)))
#define bM4_INTC_EIRQCR8_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20604UL)))
#define bM4_INTC_EIRQCR8_EISMPCLK0                (*((volatile unsigned int*)(0x42A20610UL)))
#define bM4_INTC_EIRQCR8_EISMPCLK1                (*((volatile unsigned int*)(0x42A20614UL)))
#define bM4_INTC_EIRQCR8_EFEN                     (*((volatile unsigned int*)(0x42A2061CUL)))
#define bM4_INTC_EIRQCR9_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20680UL)))
#define bM4_INTC_EIRQCR9_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20684UL)))
#define bM4_INTC_EIRQCR9_EISMPCLK0                (*((volatile unsigned int*)(0x42A20690UL)))
#define bM4_INTC_EIRQCR9_EISMPCLK1                (*((volatile unsigned int*)(0x42A20694UL)))
#define bM4_INTC_EIRQCR9_EFEN                     (*((volatile unsigned int*)(0x42A2069CUL)))
#define bM4_INTC_EIRQCR10_EIRQTRG0                (*((volatile unsigned int*)(0x42A20700UL)))
#define bM4_INTC_EIRQCR10_EIRQTRG1                (*((volatile unsigned int*)(0x42A20704UL)))
#define bM4_INTC_EIRQCR10_EISMPCLK0               (*((volatile unsigned int*)(0x42A20710UL)))
#define bM4_INTC_EIRQCR10_EISMPCLK1               (*((volatile unsigned int*)(0x42A20714UL)))
#define bM4_INTC_EIRQCR10_EFEN                    (*((volatile unsigned int*)(0x42A2071CUL)))
#define bM4_INTC_EIRQCR11_EIRQTRG0                (*((volatile unsigned int*)(0x42A20780UL)))
#define bM4_INTC_EIRQCR11_EIRQTRG1                (*((volatile unsigned int*)(0x42A20784UL)))
#define bM4_INTC_EIRQCR11_EISMPCLK0               (*((volatile unsigned int*)(0x42A20790UL)))
#define bM4_INTC_EIRQCR11_EISMPCLK1               (*((volatile unsigned int*)(0x42A20794UL)))
#define bM4_INTC_EIRQCR11_EFEN                    (*((volatile unsigned int*)(0x42A2079CUL)))
#define bM4_INTC_EIRQCR12_EIRQTRG0                (*((volatile unsigned int*)(0x42A20800UL)))
#define bM4_INTC_EIRQCR12_EIRQTRG1                (*((volatile unsigned int*)(0x42A20804UL)))
#define bM4_INTC_EIRQCR12_EISMPCLK0               (*((volatile unsigned int*)(0x42A20810UL)))
#define bM4_INTC_EIRQCR12_EISMPCLK1               (*((volatile unsigned int*)(0x42A20814UL)))
#define bM4_INTC_EIRQCR12_EFEN                    (*((volatile unsigned int*)(0x42A2081CUL)))
#define bM4_INTC_EIRQCR13_EIRQTRG0                (*((volatile unsigned int*)(0x42A20880UL)))
#define bM4_INTC_EIRQCR13_EIRQTRG1                (*((volatile unsigned int*)(0x42A20884UL)))
#define bM4_INTC_EIRQCR13_EISMPCLK0               (*((volatile unsigned int*)(0x42A20890UL)))
#define bM4_INTC_EIRQCR13_EISMPCLK1               (*((volatile unsigned int*)(0x42A20894UL)))
#define bM4_INTC_EIRQCR13_EFEN                    (*((volatile unsigned int*)(0x42A2089CUL)))
#define bM4_INTC_EIRQCR14_EIRQTRG0                (*((volatile unsigned int*)(0x42A20900UL)))
#define bM4_INTC_EIRQCR14_EIRQTRG1                (*((volatile unsigned int*)(0x42A20904UL)))
#define bM4_INTC_EIRQCR14_EISMPCLK0               (*((volatile unsigned int*)(0x42A20910UL)))
#define bM4_INTC_EIRQCR14_EISMPCLK1               (*((volatile unsigned int*)(0x42A20914UL)))
#define bM4_INTC_EIRQCR14_EFEN                    (*((volatile unsigned int*)(0x42A2091CUL)))
#define bM4_INTC_EIRQCR15_EIRQTRG0                (*((volatile unsigned int*)(0x42A20980UL)))
#define bM4_INTC_EIRQCR15_EIRQTRG1                (*((volatile unsigned int*)(0x42A20984UL)))
#define bM4_INTC_EIRQCR15_EISMPCLK0               (*((volatile unsigned int*)(0x42A20990UL)))
#define bM4_INTC_EIRQCR15_EISMPCLK1               (*((volatile unsigned int*)(0x42A20994UL)))
#define bM4_INTC_EIRQCR15_EFEN                    (*((volatile unsigned int*)(0x42A2099CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN0                  (*((volatile unsigned int*)(0x42A20A00UL)))
#define bM4_INTC_WUPEN_EIRQWUEN1                  (*((volatile unsigned int*)(0x42A20A04UL)))
#define bM4_INTC_WUPEN_EIRQWUEN2                  (*((volatile unsigned int*)(0x42A20A08UL)))
#define bM4_INTC_WUPEN_EIRQWUEN3                  (*((volatile unsigned int*)(0x42A20A0CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN4                  (*((volatile unsigned int*)(0x42A20A10UL)))
#define bM4_INTC_WUPEN_EIRQWUEN5                  (*((volatile unsigned int*)(0x42A20A14UL)))
#define bM4_INTC_WUPEN_EIRQWUEN6                  (*((volatile unsigned int*)(0x42A20A18UL)))
#define bM4_INTC_WUPEN_EIRQWUEN7                  (*((volatile unsigned int*)(0x42A20A1CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN8                  (*((volatile unsigned int*)(0x42A20A20UL)))
#define bM4_INTC_WUPEN_EIRQWUEN9                  (*((volatile unsigned int*)(0x42A20A24UL)))
#define bM4_INTC_WUPEN_EIRQWUEN10                 (*((volatile unsigned int*)(0x42A20A28UL)))
#define bM4_INTC_WUPEN_EIRQWUEN11                 (*((volatile unsigned int*)(0x42A20A2CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN12                 (*((volatile unsigned int*)(0x42A20A30UL)))
#define bM4_INTC_WUPEN_EIRQWUEN13                 (*((volatile unsigned int*)(0x42A20A34UL)))
#define bM4_INTC_WUPEN_EIRQWUEN14                 (*((volatile unsigned int*)(0x42A20A38UL)))
#define bM4_INTC_WUPEN_EIRQWUEN15                 (*((volatile unsigned int*)(0x42A20A3CUL)))
#define bM4_INTC_WUPEN_SWDTWUEN                   (*((volatile unsigned int*)(0x42A20A40UL)))
#define bM4_INTC_WUPEN_PVD1WUEN                   (*((volatile unsigned int*)(0x42A20A44UL)))
#define bM4_INTC_WUPEN_PVD2WUEN                   (*((volatile unsigned int*)(0x42A20A48UL)))
#define bM4_INTC_WUPEN_CMPI0WUEN                  (*((volatile unsigned int*)(0x42A20A4CUL)))
#define bM4_INTC_WUPEN_WKTMWUEN                   (*((volatile unsigned int*)(0x42A20A50UL)))
#define bM4_INTC_WUPEN_RTCALMWUEN                 (*((volatile unsigned int*)(0x42A20A54UL)))
#define bM4_INTC_WUPEN_RTCPRDWUEN                 (*((volatile unsigned int*)(0x42A20A58UL)))
#define bM4_INTC_WUPEN_TMR0WUEN                   (*((volatile unsigned int*)(0x42A20A5CUL)))
#define bM4_INTC_WUPEN_RXWUEN                     (*((volatile unsigned int*)(0x42A20A64UL)))
#define bM4_INTC_EIFR_EIFR0                       (*((volatile unsigned int*)(0x42A20A80UL)))
#define bM4_INTC_EIFR_EIFR1                       (*((volatile unsigned int*)(0x42A20A84UL)))
#define bM4_INTC_EIFR_EIFR2                       (*((volatile unsigned int*)(0x42A20A88UL)))
#define bM4_INTC_EIFR_EIFR3                       (*((volatile unsigned int*)(0x42A20A8CUL)))
#define bM4_INTC_EIFR_EIFR4                       (*((volatile unsigned int*)(0x42A20A90UL)))
#define bM4_INTC_EIFR_EIFR5                       (*((volatile unsigned int*)(0x42A20A94UL)))
#define bM4_INTC_EIFR_EIFR6                       (*((volatile unsigned int*)(0x42A20A98UL)))
#define bM4_INTC_EIFR_EIFR7                       (*((volatile unsigned int*)(0x42A20A9CUL)))
#define bM4_INTC_EIFR_EIFR8                       (*((volatile unsigned int*)(0x42A20AA0UL)))
#define bM4_INTC_EIFR_EIFR9                       (*((volatile unsigned int*)(0x42A20AA4UL)))
#define bM4_INTC_EIFR_EIFR10                      (*((volatile unsigned int*)(0x42A20AA8UL)))
#define bM4_INTC_EIFR_EIFR11                      (*((volatile unsigned int*)(0x42A20AACUL)))
#define bM4_INTC_EIFR_EIFR12                      (*((volatile unsigned int*)(0x42A20AB0UL)))
#define bM4_INTC_EIFR_EIFR13                      (*((volatile unsigned int*)(0x42A20AB4UL)))
#define bM4_INTC_EIFR_EIFR14                      (*((volatile unsigned int*)(0x42A20AB8UL)))
#define bM4_INTC_EIFR_EIFR15                      (*((volatile unsigned int*)(0x42A20ABCUL)))
#define bM4_INTC_EICFR_EICFR0                     (*((volatile unsigned int*)(0x42A20B00UL)))
#define bM4_INTC_EICFR_EICFR1                     (*((volatile unsigned int*)(0x42A20B04UL)))
#define bM4_INTC_EICFR_EICFR2                     (*((volatile unsigned int*)(0x42A20B08UL)))
#define bM4_INTC_EICFR_EICFR3                     (*((volatile unsigned int*)(0x42A20B0CUL)))
#define bM4_INTC_EICFR_EICFR4                     (*((volatile unsigned int*)(0x42A20B10UL)))
#define bM4_INTC_EICFR_EICFR5                     (*((volatile unsigned int*)(0x42A20B14UL)))
#define bM4_INTC_EICFR_EICFR6                     (*((volatile unsigned int*)(0x42A20B18UL)))
#define bM4_INTC_EICFR_EICFR7                     (*((volatile unsigned int*)(0x42A20B1CUL)))
#define bM4_INTC_EICFR_EICFR8                     (*((volatile unsigned int*)(0x42A20B20UL)))
#define bM4_INTC_EICFR_EICFR9                     (*((volatile unsigned int*)(0x42A20B24UL)))
#define bM4_INTC_EICFR_EICFR10                    (*((volatile unsigned int*)(0x42A20B28UL)))
#define bM4_INTC_EICFR_EICFR11                    (*((volatile unsigned int*)(0x42A20B2CUL)))
#define bM4_INTC_EICFR_EICFR12                    (*((volatile unsigned int*)(0x42A20B30UL)))
#define bM4_INTC_EICFR_EICFR13                    (*((volatile unsigned int*)(0x42A20B34UL)))
#define bM4_INTC_EICFR_EICFR14                    (*((volatile unsigned int*)(0x42A20B38UL)))
#define bM4_INTC_EICFR_EICFR15                    (*((volatile unsigned int*)(0x42A20B3CUL)))
#define bM4_INTC_SEL0_INTSEL0                     (*((volatile unsigned int*)(0x42A20B80UL)))
#define bM4_INTC_SEL0_INTSEL1                     (*((volatile unsigned int*)(0x42A20B84UL)))
#define bM4_INTC_SEL0_INTSEL2                     (*((volatile unsigned int*)(0x42A20B88UL)))
#define bM4_INTC_SEL0_INTSEL3                     (*((volatile unsigned int*)(0x42A20B8CUL)))
#define bM4_INTC_SEL0_INTSEL4                     (*((volatile unsigned int*)(0x42A20B90UL)))
#define bM4_INTC_SEL0_INTSEL5                     (*((volatile unsigned int*)(0x42A20B94UL)))
#define bM4_INTC_SEL0_INTSEL6                     (*((volatile unsigned int*)(0x42A20B98UL)))
#define bM4_INTC_SEL0_INTSEL7                     (*((volatile unsigned int*)(0x42A20B9CUL)))
#define bM4_INTC_SEL0_INTSEL8                     (*((volatile unsigned int*)(0x42A20BA0UL)))
#define bM4_INTC_SEL1_INTSEL0                     (*((volatile unsigned int*)(0x42A20C00UL)))
#define bM4_INTC_SEL1_INTSEL1                     (*((volatile unsigned int*)(0x42A20C04UL)))
#define bM4_INTC_SEL1_INTSEL2                     (*((volatile unsigned int*)(0x42A20C08UL)))
#define bM4_INTC_SEL1_INTSEL3                     (*((volatile unsigned int*)(0x42A20C0CUL)))
#define bM4_INTC_SEL1_INTSEL4                     (*((volatile unsigned int*)(0x42A20C10UL)))
#define bM4_INTC_SEL1_INTSEL5                     (*((volatile unsigned int*)(0x42A20C14UL)))
#define bM4_INTC_SEL1_INTSEL6                     (*((volatile unsigned int*)(0x42A20C18UL)))
#define bM4_INTC_SEL1_INTSEL7                     (*((volatile unsigned int*)(0x42A20C1CUL)))
#define bM4_INTC_SEL1_INTSEL8                     (*((volatile unsigned int*)(0x42A20C20UL)))
#define bM4_INTC_SEL2_INTSEL0                     (*((volatile unsigned int*)(0x42A20C80UL)))
#define bM4_INTC_SEL2_INTSEL1                     (*((volatile unsigned int*)(0x42A20C84UL)))
#define bM4_INTC_SEL2_INTSEL2                     (*((volatile unsigned int*)(0x42A20C88UL)))
#define bM4_INTC_SEL2_INTSEL3                     (*((volatile unsigned int*)(0x42A20C8CUL)))
#define bM4_INTC_SEL2_INTSEL4                     (*((volatile unsigned int*)(0x42A20C90UL)))
#define bM4_INTC_SEL2_INTSEL5                     (*((volatile unsigned int*)(0x42A20C94UL)))
#define bM4_INTC_SEL2_INTSEL6                     (*((volatile unsigned int*)(0x42A20C98UL)))
