thtfcccj/CMSIS/hc32f46xb.h
#define bM4_RTC_SEC_SECD1                         (*((volatile unsigned int*)(0x42980214UL)))
#define bM4_RTC_SEC_SECD2                         (*((volatile unsigned int*)(0x42980218UL)))
#define bM4_RTC_MIN_MINU0                         (*((volatile unsigned int*)(0x42980280UL)))
#define bM4_RTC_MIN_MINU1                         (*((volatile unsigned int*)(0x42980284UL)))
#define bM4_RTC_MIN_MINU2                         (*((volatile unsigned int*)(0x42980288UL)))
#define bM4_RTC_MIN_MINU3                         (*((volatile unsigned int*)(0x4298028CUL)))
#define bM4_RTC_MIN_MIND0                         (*((volatile unsigned int*)(0x42980290UL)))
#define bM4_RTC_MIN_MIND1                         (*((volatile unsigned int*)(0x42980294UL)))
#define bM4_RTC_MIN_MIND2                         (*((volatile unsigned int*)(0x42980298UL)))
#define bM4_RTC_HOUR_HOURU0                       (*((volatile unsigned int*)(0x42980300UL)))
#define bM4_RTC_HOUR_HOURU1                       (*((volatile unsigned int*)(0x42980304UL)))
#define bM4_RTC_HOUR_HOURU2                       (*((volatile unsigned int*)(0x42980308UL)))
#define bM4_RTC_HOUR_HOURU3                       (*((volatile unsigned int*)(0x4298030CUL)))
#define bM4_RTC_HOUR_HOURD0                       (*((volatile unsigned int*)(0x42980310UL)))
#define bM4_RTC_HOUR_HOURD1                       (*((volatile unsigned int*)(0x42980314UL)))
#define bM4_RTC_WEEK_WEEK0                        (*((volatile unsigned int*)(0x42980380UL)))
#define bM4_RTC_WEEK_WEEK1                        (*((volatile unsigned int*)(0x42980384UL)))
#define bM4_RTC_WEEK_WEEK2                        (*((volatile unsigned int*)(0x42980388UL)))
#define bM4_RTC_DAY_DAYU0                         (*((volatile unsigned int*)(0x42980400UL)))
#define bM4_RTC_DAY_DAYU1                         (*((volatile unsigned int*)(0x42980404UL)))
#define bM4_RTC_DAY_DAYU2                         (*((volatile unsigned int*)(0x42980408UL)))
#define bM4_RTC_DAY_DAYU3                         (*((volatile unsigned int*)(0x4298040CUL)))
#define bM4_RTC_DAY_DAYD0                         (*((volatile unsigned int*)(0x42980410UL)))
#define bM4_RTC_DAY_DAYD1                         (*((volatile unsigned int*)(0x42980414UL)))
#define bM4_RTC_MON_MON0                          (*((volatile unsigned int*)(0x42980480UL)))
#define bM4_RTC_MON_MON1                          (*((volatile unsigned int*)(0x42980484UL)))
#define bM4_RTC_MON_MON2                          (*((volatile unsigned int*)(0x42980488UL)))
#define bM4_RTC_MON_MON3                          (*((volatile unsigned int*)(0x4298048CUL)))
#define bM4_RTC_MON_MON4                          (*((volatile unsigned int*)(0x42980490UL)))
#define bM4_RTC_YEAR_YEARU0                       (*((volatile unsigned int*)(0x42980500UL)))
#define bM4_RTC_YEAR_YEARU1                       (*((volatile unsigned int*)(0x42980504UL)))
#define bM4_RTC_YEAR_YEARU2                       (*((volatile unsigned int*)(0x42980508UL)))
#define bM4_RTC_YEAR_YEARU3                       (*((volatile unsigned int*)(0x4298050CUL)))
#define bM4_RTC_YEAR_YEARD0                       (*((volatile unsigned int*)(0x42980510UL)))
#define bM4_RTC_YEAR_YEARD1                       (*((volatile unsigned int*)(0x42980514UL)))
#define bM4_RTC_YEAR_YEARD2                       (*((volatile unsigned int*)(0x42980518UL)))
#define bM4_RTC_YEAR_YEARD3                       (*((volatile unsigned int*)(0x4298051CUL)))
#define bM4_RTC_ALMMIN_ALMMINU0                   (*((volatile unsigned int*)(0x42980580UL)))
#define bM4_RTC_ALMMIN_ALMMINU1                   (*((volatile unsigned int*)(0x42980584UL)))
#define bM4_RTC_ALMMIN_ALMMINU2                   (*((volatile unsigned int*)(0x42980588UL)))
#define bM4_RTC_ALMMIN_ALMMINU3                   (*((volatile unsigned int*)(0x4298058CUL)))
#define bM4_RTC_ALMMIN_ALMMIND0                   (*((volatile unsigned int*)(0x42980590UL)))
#define bM4_RTC_ALMMIN_ALMMIND1                   (*((volatile unsigned int*)(0x42980594UL)))
#define bM4_RTC_ALMMIN_ALMMIND2                   (*((volatile unsigned int*)(0x42980598UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU0                 (*((volatile unsigned int*)(0x42980600UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU1                 (*((volatile unsigned int*)(0x42980604UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU2                 (*((volatile unsigned int*)(0x42980608UL)))
#define bM4_RTC_ALMHOUR_ALMHOURU3                 (*((volatile unsigned int*)(0x4298060CUL)))
#define bM4_RTC_ALMHOUR_ALMHOURD0                 (*((volatile unsigned int*)(0x42980610UL)))
#define bM4_RTC_ALMHOUR_ALMHOURD1                 (*((volatile unsigned int*)(0x42980614UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK0                  (*((volatile unsigned int*)(0x42980680UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK1                  (*((volatile unsigned int*)(0x42980684UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK2                  (*((volatile unsigned int*)(0x42980688UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK3                  (*((volatile unsigned int*)(0x4298068CUL)))
#define bM4_RTC_ALMWEEK_ALMWEEK4                  (*((volatile unsigned int*)(0x42980690UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK5                  (*((volatile unsigned int*)(0x42980694UL)))
#define bM4_RTC_ALMWEEK_ALMWEEK6                  (*((volatile unsigned int*)(0x42980698UL)))
#define bM4_RTC_ERRCRH_COMP8                      (*((volatile unsigned int*)(0x42980700UL)))
#define bM4_RTC_ERRCRH_COMPEN                     (*((volatile unsigned int*)(0x4298071CUL)))
#define bM4_RTC_ERRCRL_COMP0                      (*((volatile unsigned int*)(0x42980780UL)))
#define bM4_RTC_ERRCRL_COMP1                      (*((volatile unsigned int*)(0x42980784UL)))
#define bM4_RTC_ERRCRL_COMP2                      (*((volatile unsigned int*)(0x42980788UL)))
#define bM4_RTC_ERRCRL_COMP3                      (*((volatile unsigned int*)(0x4298078CUL)))
#define bM4_RTC_ERRCRL_COMP4                      (*((volatile unsigned int*)(0x42980790UL)))
#define bM4_RTC_ERRCRL_COMP5                      (*((volatile unsigned int*)(0x42980794UL)))
#define bM4_RTC_ERRCRL_COMP6                      (*((volatile unsigned int*)(0x42980798UL)))
#define bM4_RTC_ERRCRL_COMP7                      (*((volatile unsigned int*)(0x4298079CUL)))
#define bM4_SDIOC1_BLKSIZE_TBS0                   (*((volatile unsigned int*)(0x42DF8080UL)))
#define bM4_SDIOC1_BLKSIZE_TBS1                   (*((volatile unsigned int*)(0x42DF8084UL)))
#define bM4_SDIOC1_BLKSIZE_TBS2                   (*((volatile unsigned int*)(0x42DF8088UL)))
#define bM4_SDIOC1_BLKSIZE_TBS3                   (*((volatile unsigned int*)(0x42DF808CUL)))
#define bM4_SDIOC1_BLKSIZE_TBS4                   (*((volatile unsigned int*)(0x42DF8090UL)))
#define bM4_SDIOC1_BLKSIZE_TBS5                   (*((volatile unsigned int*)(0x42DF8094UL)))
#define bM4_SDIOC1_BLKSIZE_TBS6                   (*((volatile unsigned int*)(0x42DF8098UL)))
#define bM4_SDIOC1_BLKSIZE_TBS7                   (*((volatile unsigned int*)(0x42DF809CUL)))
#define bM4_SDIOC1_BLKSIZE_TBS8                   (*((volatile unsigned int*)(0x42DF80A0UL)))
#define bM4_SDIOC1_BLKSIZE_TBS9                   (*((volatile unsigned int*)(0x42DF80A4UL)))
#define bM4_SDIOC1_BLKSIZE_TBS10                  (*((volatile unsigned int*)(0x42DF80A8UL)))
#define bM4_SDIOC1_BLKSIZE_TBS11                  (*((volatile unsigned int*)(0x42DF80ACUL)))
#define bM4_SDIOC1_TRANSMODE_BCE                  (*((volatile unsigned int*)(0x42DF8184UL)))
#define bM4_SDIOC1_TRANSMODE_ATCEN0               (*((volatile unsigned int*)(0x42DF8188UL)))
#define bM4_SDIOC1_TRANSMODE_ATCEN1               (*((volatile unsigned int*)(0x42DF818CUL)))
#define bM4_SDIOC1_TRANSMODE_DDIR                 (*((volatile unsigned int*)(0x42DF8190UL)))
#define bM4_SDIOC1_TRANSMODE_MULB                 (*((volatile unsigned int*)(0x42DF8194UL)))
#define bM4_SDIOC1_CMD_RESTYP0                    (*((volatile unsigned int*)(0x42DF81C0UL)))
#define bM4_SDIOC1_CMD_RESTYP1                    (*((volatile unsigned int*)(0x42DF81C4UL)))
#define bM4_SDIOC1_CMD_CCE                        (*((volatile unsigned int*)(0x42DF81CCUL)))
#define bM4_SDIOC1_CMD_ICE                        (*((volatile unsigned int*)(0x42DF81D0UL)))
#define bM4_SDIOC1_CMD_DAT                        (*((volatile unsigned int*)(0x42DF81D4UL)))
#define bM4_SDIOC1_CMD_TYP0                       (*((volatile unsigned int*)(0x42DF81D8UL)))
#define bM4_SDIOC1_CMD_TYP1                       (*((volatile unsigned int*)(0x42DF81DCUL)))
#define bM4_SDIOC1_CMD_IDX0                       (*((volatile unsigned int*)(0x42DF81E0UL)))
#define bM4_SDIOC1_CMD_IDX1                       (*((volatile unsigned int*)(0x42DF81E4UL)))
#define bM4_SDIOC1_CMD_IDX2                       (*((volatile unsigned int*)(0x42DF81E8UL)))
#define bM4_SDIOC1_CMD_IDX3                       (*((volatile unsigned int*)(0x42DF81ECUL)))
#define bM4_SDIOC1_CMD_IDX4                       (*((volatile unsigned int*)(0x42DF81F0UL)))
#define bM4_SDIOC1_CMD_IDX5                       (*((volatile unsigned int*)(0x42DF81F4UL)))
#define bM4_SDIOC1_PSTAT_CIC                      (*((volatile unsigned int*)(0x42DF8480UL)))
#define bM4_SDIOC1_PSTAT_CID                      (*((volatile unsigned int*)(0x42DF8484UL)))
#define bM4_SDIOC1_PSTAT_DA                       (*((volatile unsigned int*)(0x42DF8488UL)))
#define bM4_SDIOC1_PSTAT_WTA                      (*((volatile unsigned int*)(0x42DF84A0UL)))
#define bM4_SDIOC1_PSTAT_RTA                      (*((volatile unsigned int*)(0x42DF84A4UL)))
#define bM4_SDIOC1_PSTAT_BWE                      (*((volatile unsigned int*)(0x42DF84A8UL)))
#define bM4_SDIOC1_PSTAT_BRE                      (*((volatile unsigned int*)(0x42DF84ACUL)))
#define bM4_SDIOC1_PSTAT_CIN                      (*((volatile unsigned int*)(0x42DF84C0UL)))
#define bM4_SDIOC1_PSTAT_CSS                      (*((volatile unsigned int*)(0x42DF84C4UL)))
#define bM4_SDIOC1_PSTAT_CDL                      (*((volatile unsigned int*)(0x42DF84C8UL)))
#define bM4_SDIOC1_PSTAT_WPL                      (*((volatile unsigned int*)(0x42DF84CCUL)))
#define bM4_SDIOC1_PSTAT_DATL0                    (*((volatile unsigned int*)(0x42DF84D0UL)))
#define bM4_SDIOC1_PSTAT_DATL1                    (*((volatile unsigned int*)(0x42DF84D4UL)))
#define bM4_SDIOC1_PSTAT_DATL2                    (*((volatile unsigned int*)(0x42DF84D8UL)))
#define bM4_SDIOC1_PSTAT_DATL3                    (*((volatile unsigned int*)(0x42DF84DCUL)))
#define bM4_SDIOC1_PSTAT_CMDL                     (*((volatile unsigned int*)(0x42DF84E0UL)))
#define bM4_SDIOC1_HOSTCON_DW                     (*((volatile unsigned int*)(0x42DF8504UL)))
#define bM4_SDIOC1_HOSTCON_HSEN                   (*((volatile unsigned int*)(0x42DF8508UL)))
#define bM4_SDIOC1_HOSTCON_EXDW                   (*((volatile unsigned int*)(0x42DF8514UL)))
#define bM4_SDIOC1_HOSTCON_CDTL                   (*((volatile unsigned int*)(0x42DF8518UL)))
#define bM4_SDIOC1_HOSTCON_CDSS                   (*((volatile unsigned int*)(0x42DF851CUL)))
#define bM4_SDIOC1_PWRCON_PWON                    (*((volatile unsigned int*)(0x42DF8520UL)))
#define bM4_SDIOC1_BLKGPCON_SABGR                 (*((volatile unsigned int*)(0x42DF8540UL)))
#define bM4_SDIOC1_BLKGPCON_CR                    (*((volatile unsigned int*)(0x42DF8544UL)))
#define bM4_SDIOC1_BLKGPCON_RWC                   (*((volatile unsigned int*)(0x42DF8548UL)))
#define bM4_SDIOC1_BLKGPCON_IABG                  (*((volatile unsigned int*)(0x42DF854CUL)))
#define bM4_SDIOC1_CLKCON_ICE                     (*((volatile unsigned int*)(0x42DF8580UL)))
#define bM4_SDIOC1_CLKCON_CE                      (*((volatile unsigned int*)(0x42DF8588UL)))
#define bM4_SDIOC1_CLKCON_FS0                     (*((volatile unsigned int*)(0x42DF85A0UL)))
#define bM4_SDIOC1_CLKCON_FS1                     (*((volatile unsigned int*)(0x42DF85A4UL)))
#define bM4_SDIOC1_CLKCON_FS2                     (*((volatile unsigned int*)(0x42DF85A8UL)))
#define bM4_SDIOC1_CLKCON_FS3                     (*((volatile unsigned int*)(0x42DF85ACUL)))
#define bM4_SDIOC1_CLKCON_FS4                     (*((volatile unsigned int*)(0x42DF85B0UL)))
#define bM4_SDIOC1_CLKCON_FS5                     (*((volatile unsigned int*)(0x42DF85B4UL)))
#define bM4_SDIOC1_CLKCON_FS6                     (*((volatile unsigned int*)(0x42DF85B8UL)))
#define bM4_SDIOC1_CLKCON_FS7                     (*((volatile unsigned int*)(0x42DF85BCUL)))
#define bM4_SDIOC1_TOUTCON_DTO0                   (*((volatile unsigned int*)(0x42DF85C0UL)))
#define bM4_SDIOC1_TOUTCON_DTO1                   (*((volatile unsigned int*)(0x42DF85C4UL)))
#define bM4_SDIOC1_TOUTCON_DTO2                   (*((volatile unsigned int*)(0x42DF85C8UL)))
#define bM4_SDIOC1_TOUTCON_DTO3                   (*((volatile unsigned int*)(0x42DF85CCUL)))
#define bM4_SDIOC1_SFTRST_RSTA                    (*((volatile unsigned int*)(0x42DF85E0UL)))
#define bM4_SDIOC1_SFTRST_RSTC                    (*((volatile unsigned int*)(0x42DF85E4UL)))
#define bM4_SDIOC1_SFTRST_RSTD                    (*((volatile unsigned int*)(0x42DF85E8UL)))
#define bM4_SDIOC1_NORINTST_CC                    (*((volatile unsigned int*)(0x42DF8600UL)))
#define bM4_SDIOC1_NORINTST_TC                    (*((volatile unsigned int*)(0x42DF8604UL)))
#define bM4_SDIOC1_NORINTST_BGE                   (*((volatile unsigned int*)(0x42DF8608UL)))
#define bM4_SDIOC1_NORINTST_BWR                   (*((volatile unsigned int*)(0x42DF8610UL)))
#define bM4_SDIOC1_NORINTST_BRR                   (*((volatile unsigned int*)(0x42DF8614UL)))
#define bM4_SDIOC1_NORINTST_CIST                  (*((volatile unsigned int*)(0x42DF8618UL)))
#define bM4_SDIOC1_NORINTST_CRM                   (*((volatile unsigned int*)(0x42DF861CUL)))
#define bM4_SDIOC1_NORINTST_CINT                  (*((volatile unsigned int*)(0x42DF8620UL)))
#define bM4_SDIOC1_NORINTST_EI                    (*((volatile unsigned int*)(0x42DF863CUL)))
#define bM4_SDIOC1_ERRINTST_CTOE                  (*((volatile unsigned int*)(0x42DF8640UL)))
#define bM4_SDIOC1_ERRINTST_CCE                   (*((volatile unsigned int*)(0x42DF8644UL)))
#define bM4_SDIOC1_ERRINTST_CEBE                  (*((volatile unsigned int*)(0x42DF8648UL)))
#define bM4_SDIOC1_ERRINTST_CIE                   (*((volatile unsigned int*)(0x42DF864CUL)))
#define bM4_SDIOC1_ERRINTST_DTOE                  (*((volatile unsigned int*)(0x42DF8650UL)))
#define bM4_SDIOC1_ERRINTST_DCE                   (*((volatile unsigned int*)(0x42DF8654UL)))
#define bM4_SDIOC1_ERRINTST_DEBE                  (*((volatile unsigned int*)(0x42DF8658UL)))
#define bM4_SDIOC1_ERRINTST_ACE                   (*((volatile unsigned int*)(0x42DF8660UL)))
#define bM4_SDIOC1_NORINTSTEN_CCEN                (*((volatile unsigned int*)(0x42DF8680UL)))
#define bM4_SDIOC1_NORINTSTEN_TCEN                (*((volatile unsigned int*)(0x42DF8684UL)))
#define bM4_SDIOC1_NORINTSTEN_BGEEN               (*((volatile unsigned int*)(0x42DF8688UL)))
#define bM4_SDIOC1_NORINTSTEN_BWREN               (*((volatile unsigned int*)(0x42DF8690UL)))
#define bM4_SDIOC1_NORINTSTEN_BRREN               (*((volatile unsigned int*)(0x42DF8694UL)))
#define bM4_SDIOC1_NORINTSTEN_CISTEN              (*((volatile unsigned int*)(0x42DF8698UL)))
#define bM4_SDIOC1_NORINTSTEN_CRMEN               (*((volatile unsigned int*)(0x42DF869CUL)))
#define bM4_SDIOC1_NORINTSTEN_CINTEN              (*((volatile unsigned int*)(0x42DF86A0UL)))
#define bM4_SDIOC1_ERRINTSTEN_CTOEEN              (*((volatile unsigned int*)(0x42DF86C0UL)))
#define bM4_SDIOC1_ERRINTSTEN_CCEEN               (*((volatile unsigned int*)(0x42DF86C4UL)))
#define bM4_SDIOC1_ERRINTSTEN_CEBEEN              (*((volatile unsigned int*)(0x42DF86C8UL)))
#define bM4_SDIOC1_ERRINTSTEN_CIEEN               (*((volatile unsigned int*)(0x42DF86CCUL)))
#define bM4_SDIOC1_ERRINTSTEN_DTOEEN              (*((volatile unsigned int*)(0x42DF86D0UL)))
#define bM4_SDIOC1_ERRINTSTEN_DCEEN               (*((volatile unsigned int*)(0x42DF86D4UL)))
#define bM4_SDIOC1_ERRINTSTEN_DEBEEN              (*((volatile unsigned int*)(0x42DF86D8UL)))
#define bM4_SDIOC1_ERRINTSTEN_ACEEN               (*((volatile unsigned int*)(0x42DF86E0UL)))
#define bM4_SDIOC1_NORINTSGEN_CCSEN               (*((volatile unsigned int*)(0x42DF8700UL)))
#define bM4_SDIOC1_NORINTSGEN_TCSEN               (*((volatile unsigned int*)(0x42DF8704UL)))
#define bM4_SDIOC1_NORINTSGEN_BGESEN              (*((volatile unsigned int*)(0x42DF8708UL)))
#define bM4_SDIOC1_NORINTSGEN_BWRSEN              (*((volatile unsigned int*)(0x42DF8710UL)))
#define bM4_SDIOC1_NORINTSGEN_BRRSEN              (*((volatile unsigned int*)(0x42DF8714UL)))
#define bM4_SDIOC1_NORINTSGEN_CISTSEN             (*((volatile unsigned int*)(0x42DF8718UL)))
#define bM4_SDIOC1_NORINTSGEN_CRMSEN              (*((volatile unsigned int*)(0x42DF871CUL)))
#define bM4_SDIOC1_NORINTSGEN_CINTSEN             (*((volatile unsigned int*)(0x42DF8720UL)))
#define bM4_SDIOC1_ERRINTSGEN_CTOESEN             (*((volatile unsigned int*)(0x42DF8740UL)))
#define bM4_SDIOC1_ERRINTSGEN_CCESEN              (*((volatile unsigned int*)(0x42DF8744UL)))
#define bM4_SDIOC1_ERRINTSGEN_CEBESEN             (*((volatile unsigned int*)(0x42DF8748UL)))
#define bM4_SDIOC1_ERRINTSGEN_CIESEN              (*((volatile unsigned int*)(0x42DF874CUL)))
#define bM4_SDIOC1_ERRINTSGEN_DTOESEN             (*((volatile unsigned int*)(0x42DF8750UL)))
#define bM4_SDIOC1_ERRINTSGEN_DCESEN              (*((volatile unsigned int*)(0x42DF8754UL)))
#define bM4_SDIOC1_ERRINTSGEN_DEBESEN             (*((volatile unsigned int*)(0x42DF8758UL)))
#define bM4_SDIOC1_ERRINTSGEN_ACESEN              (*((volatile unsigned int*)(0x42DF8760UL)))
#define bM4_SDIOC1_ATCERRST_NE                    (*((volatile unsigned int*)(0x42DF8780UL)))
#define bM4_SDIOC1_ATCERRST_TOE                   (*((volatile unsigned int*)(0x42DF8784UL)))
#define bM4_SDIOC1_ATCERRST_CE                    (*((volatile unsigned int*)(0x42DF8788UL)))
#define bM4_SDIOC1_ATCERRST_EBE                   (*((volatile unsigned int*)(0x42DF878CUL)))
#define bM4_SDIOC1_ATCERRST_IE                    (*((volatile unsigned int*)(0x42DF8790UL)))
#define bM4_SDIOC1_ATCERRST_CMDE                  (*((volatile unsigned int*)(0x42DF879CUL)))
#define bM4_SDIOC1_FEA_FNE                        (*((volatile unsigned int*)(0x42DF8A00UL)))
#define bM4_SDIOC1_FEA_FTOE                       (*((volatile unsigned int*)(0x42DF8A04UL)))
#define bM4_SDIOC1_FEA_FCE                        (*((volatile unsigned int*)(0x42DF8A08UL)))
#define bM4_SDIOC1_FEA_FEBE                       (*((volatile unsigned int*)(0x42DF8A0CUL)))
#define bM4_SDIOC1_FEA_FIE                        (*((volatile unsigned int*)(0x42DF8A10UL)))
#define bM4_SDIOC1_FEA_FCMDE                      (*((volatile unsigned int*)(0x42DF8A1CUL)))
#define bM4_SDIOC1_FEE_FCTOE                      (*((volatile unsigned int*)(0x42DF8A40UL)))
#define bM4_SDIOC1_FEE_FCCE                       (*((volatile unsigned int*)(0x42DF8A44UL)))
#define bM4_SDIOC1_FEE_FCEBE                      (*((volatile unsigned int*)(0x42DF8A48UL)))
#define bM4_SDIOC1_FEE_FCIE                       (*((volatile unsigned int*)(0x42DF8A4CUL)))
#define bM4_SDIOC1_FEE_FDTOE                      (*((volatile unsigned int*)(0x42DF8A50UL)))
#define bM4_SDIOC1_FEE_FDCE                       (*((volatile unsigned int*)(0x42DF8A54UL)))
#define bM4_SDIOC1_FEE_FDEBE                      (*((volatile unsigned int*)(0x42DF8A58UL)))
#define bM4_SDIOC1_FEE_FACE                       (*((volatile unsigned int*)(0x42DF8A60UL)))
#define bM4_SDIOC2_BLKSIZE_TBS0                   (*((volatile unsigned int*)(0x42E00080UL)))
#define bM4_SDIOC2_BLKSIZE_TBS1                   (*((volatile unsigned int*)(0x42E00084UL)))
#define bM4_SDIOC2_BLKSIZE_TBS2                   (*((volatile unsigned int*)(0x42E00088UL)))
#define bM4_SDIOC2_BLKSIZE_TBS3                   (*((volatile unsigned int*)(0x42E0008CUL)))
#define bM4_SDIOC2_BLKSIZE_TBS4                   (*((volatile unsigned int*)(0x42E00090UL)))
#define bM4_SDIOC2_BLKSIZE_TBS5                   (*((volatile unsigned int*)(0x42E00094UL)))
#define bM4_SDIOC2_BLKSIZE_TBS6                   (*((volatile unsigned int*)(0x42E00098UL)))
#define bM4_SDIOC2_BLKSIZE_TBS7                   (*((volatile unsigned int*)(0x42E0009CUL)))
#define bM4_SDIOC2_BLKSIZE_TBS8                   (*((volatile unsigned int*)(0x42E000A0UL)))
#define bM4_SDIOC2_BLKSIZE_TBS9                   (*((volatile unsigned int*)(0x42E000A4UL)))
#define bM4_SDIOC2_BLKSIZE_TBS10                  (*((volatile unsigned int*)(0x42E000A8UL)))
#define bM4_SDIOC2_BLKSIZE_TBS11                  (*((volatile unsigned int*)(0x42E000ACUL)))
#define bM4_SDIOC2_TRANSMODE_BCE                  (*((volatile unsigned int*)(0x42E00184UL)))
#define bM4_SDIOC2_TRANSMODE_ATCEN0               (*((volatile unsigned int*)(0x42E00188UL)))
#define bM4_SDIOC2_TRANSMODE_ATCEN1               (*((volatile unsigned int*)(0x42E0018CUL)))
#define bM4_SDIOC2_TRANSMODE_DDIR                 (*((volatile unsigned int*)(0x42E00190UL)))
#define bM4_SDIOC2_TRANSMODE_MULB                 (*((volatile unsigned int*)(0x42E00194UL)))
#define bM4_SDIOC2_CMD_RESTYP0                    (*((volatile unsigned int*)(0x42E001C0UL)))
#define bM4_SDIOC2_CMD_RESTYP1                    (*((volatile unsigned int*)(0x42E001C4UL)))
#define bM4_SDIOC2_CMD_CCE                        (*((volatile unsigned int*)(0x42E001CCUL)))
#define bM4_SDIOC2_CMD_ICE                        (*((volatile unsigned int*)(0x42E001D0UL)))
#define bM4_SDIOC2_CMD_DAT                        (*((volatile unsigned int*)(0x42E001D4UL)))
#define bM4_SDIOC2_CMD_TYP0                       (*((volatile unsigned int*)(0x42E001D8UL)))
#define bM4_SDIOC2_CMD_TYP1                       (*((volatile unsigned int*)(0x42E001DCUL)))
#define bM4_SDIOC2_CMD_IDX0                       (*((volatile unsigned int*)(0x42E001E0UL)))
#define bM4_SDIOC2_CMD_IDX1                       (*((volatile unsigned int*)(0x42E001E4UL)))
#define bM4_SDIOC2_CMD_IDX2                       (*((volatile unsigned int*)(0x42E001E8UL)))
#define bM4_SDIOC2_CMD_IDX3                       (*((volatile unsigned int*)(0x42E001ECUL)))
#define bM4_SDIOC2_CMD_IDX4                       (*((volatile unsigned int*)(0x42E001F0UL)))
#define bM4_SDIOC2_CMD_IDX5                       (*((volatile unsigned int*)(0x42E001F4UL)))
#define bM4_SDIOC2_PSTAT_CIC                      (*((volatile unsigned int*)(0x42E00480UL)))
#define bM4_SDIOC2_PSTAT_CID                      (*((volatile unsigned int*)(0x42E00484UL)))
#define bM4_SDIOC2_PSTAT_DA                       (*((volatile unsigned int*)(0x42E00488UL)))
#define bM4_SDIOC2_PSTAT_WTA                      (*((volatile unsigned int*)(0x42E004A0UL)))
#define bM4_SDIOC2_PSTAT_RTA                      (*((volatile unsigned int*)(0x42E004A4UL)))
#define bM4_SDIOC2_PSTAT_BWE                      (*((volatile unsigned int*)(0x42E004A8UL)))
#define bM4_SDIOC2_PSTAT_BRE                      (*((volatile unsigned int*)(0x42E004ACUL)))
#define bM4_SDIOC2_PSTAT_CIN                      (*((volatile unsigned int*)(0x42E004C0UL)))
#define bM4_SDIOC2_PSTAT_CSS                      (*((volatile unsigned int*)(0x42E004C4UL)))
#define bM4_SDIOC2_PSTAT_CDL                      (*((volatile unsigned int*)(0x42E004C8UL)))
#define bM4_SDIOC2_PSTAT_WPL                      (*((volatile unsigned int*)(0x42E004CCUL)))
#define bM4_SDIOC2_PSTAT_DATL0                    (*((volatile unsigned int*)(0x42E004D0UL)))
#define bM4_SDIOC2_PSTAT_DATL1                    (*((volatile unsigned int*)(0x42E004D4UL)))
#define bM4_SDIOC2_PSTAT_DATL2                    (*((volatile unsigned int*)(0x42E004D8UL)))
#define bM4_SDIOC2_PSTAT_DATL3                    (*((volatile unsigned int*)(0x42E004DCUL)))
#define bM4_SDIOC2_PSTAT_CMDL                     (*((volatile unsigned int*)(0x42E004E0UL)))
