thtfcccj/CMSIS/hc32f46xb.h
#define bM4_TMR42_OCSRU_OCEL                      (*((volatile unsigned int*)(0x42490304UL)))
#define bM4_TMR42_OCSRU_OCPH                      (*((volatile unsigned int*)(0x42490308UL)))
#define bM4_TMR42_OCSRU_OCPL                      (*((volatile unsigned int*)(0x4249030CUL)))
#define bM4_TMR42_OCSRU_OCIEH                     (*((volatile unsigned int*)(0x42490310UL)))
#define bM4_TMR42_OCSRU_OCIEL                     (*((volatile unsigned int*)(0x42490314UL)))
#define bM4_TMR42_OCSRU_OCFH                      (*((volatile unsigned int*)(0x42490318UL)))
#define bM4_TMR42_OCSRU_OCFL                      (*((volatile unsigned int*)(0x4249031CUL)))
#define bM4_TMR42_OCERU_CHBUFEN0                  (*((volatile unsigned int*)(0x42490340UL)))
#define bM4_TMR42_OCERU_CHBUFEN1                  (*((volatile unsigned int*)(0x42490344UL)))
#define bM4_TMR42_OCERU_CLBUFEN0                  (*((volatile unsigned int*)(0x42490348UL)))
#define bM4_TMR42_OCERU_CLBUFEN1                  (*((volatile unsigned int*)(0x4249034CUL)))
#define bM4_TMR42_OCERU_MHBUFEN0                  (*((volatile unsigned int*)(0x42490350UL)))
#define bM4_TMR42_OCERU_MHBUFEN1                  (*((volatile unsigned int*)(0x42490354UL)))
#define bM4_TMR42_OCERU_MLBUFEN0                  (*((volatile unsigned int*)(0x42490358UL)))
#define bM4_TMR42_OCERU_MLBUFEN1                  (*((volatile unsigned int*)(0x4249035CUL)))
#define bM4_TMR42_OCERU_LMCH                      (*((volatile unsigned int*)(0x42490360UL)))
#define bM4_TMR42_OCERU_LMCL                      (*((volatile unsigned int*)(0x42490364UL)))
#define bM4_TMR42_OCERU_LMMH                      (*((volatile unsigned int*)(0x42490368UL)))
#define bM4_TMR42_OCERU_LMML                      (*((volatile unsigned int*)(0x4249036CUL)))
#define bM4_TMR42_OCERU_MCECH                     (*((volatile unsigned int*)(0x42490370UL)))
#define bM4_TMR42_OCERU_MCECL                     (*((volatile unsigned int*)(0x42490374UL)))
#define bM4_TMR42_OCSRV_OCEH                      (*((volatile unsigned int*)(0x42490380UL)))
#define bM4_TMR42_OCSRV_OCEL                      (*((volatile unsigned int*)(0x42490384UL)))
#define bM4_TMR42_OCSRV_OCPH                      (*((volatile unsigned int*)(0x42490388UL)))
#define bM4_TMR42_OCSRV_OCPL                      (*((volatile unsigned int*)(0x4249038CUL)))
#define bM4_TMR42_OCSRV_OCIEH                     (*((volatile unsigned int*)(0x42490390UL)))
#define bM4_TMR42_OCSRV_OCIEL                     (*((volatile unsigned int*)(0x42490394UL)))
#define bM4_TMR42_OCSRV_OCFH                      (*((volatile unsigned int*)(0x42490398UL)))
#define bM4_TMR42_OCSRV_OCFL                      (*((volatile unsigned int*)(0x4249039CUL)))
#define bM4_TMR42_OCERV_CHBUFEN0                  (*((volatile unsigned int*)(0x424903C0UL)))
#define bM4_TMR42_OCERV_CHBUFEN1                  (*((volatile unsigned int*)(0x424903C4UL)))
#define bM4_TMR42_OCERV_CLBUFEN0                  (*((volatile unsigned int*)(0x424903C8UL)))
#define bM4_TMR42_OCERV_CLBUFEN1                  (*((volatile unsigned int*)(0x424903CCUL)))
#define bM4_TMR42_OCERV_MHBUFEN0                  (*((volatile unsigned int*)(0x424903D0UL)))
#define bM4_TMR42_OCERV_MHBUFEN1                  (*((volatile unsigned int*)(0x424903D4UL)))
#define bM4_TMR42_OCERV_MLBUFEN0                  (*((volatile unsigned int*)(0x424903D8UL)))
#define bM4_TMR42_OCERV_MLBUFEN1                  (*((volatile unsigned int*)(0x424903DCUL)))
#define bM4_TMR42_OCERV_LMCH                      (*((volatile unsigned int*)(0x424903E0UL)))
#define bM4_TMR42_OCERV_LMCL                      (*((volatile unsigned int*)(0x424903E4UL)))
#define bM4_TMR42_OCERV_LMMH                      (*((volatile unsigned int*)(0x424903E8UL)))
#define bM4_TMR42_OCERV_LMML                      (*((volatile unsigned int*)(0x424903ECUL)))
#define bM4_TMR42_OCERV_MCECH                     (*((volatile unsigned int*)(0x424903F0UL)))
#define bM4_TMR42_OCERV_MCECL                     (*((volatile unsigned int*)(0x424903F4UL)))
#define bM4_TMR42_OCSRW_OCEH                      (*((volatile unsigned int*)(0x42490400UL)))
#define bM4_TMR42_OCSRW_OCEL                      (*((volatile unsigned int*)(0x42490404UL)))
#define bM4_TMR42_OCSRW_OCPH                      (*((volatile unsigned int*)(0x42490408UL)))
#define bM4_TMR42_OCSRW_OCPL                      (*((volatile unsigned int*)(0x4249040CUL)))
#define bM4_TMR42_OCSRW_OCIEH                     (*((volatile unsigned int*)(0x42490410UL)))
#define bM4_TMR42_OCSRW_OCIEL                     (*((volatile unsigned int*)(0x42490414UL)))
#define bM4_TMR42_OCSRW_OCFH                      (*((volatile unsigned int*)(0x42490418UL)))
#define bM4_TMR42_OCSRW_OCFL                      (*((volatile unsigned int*)(0x4249041CUL)))
#define bM4_TMR42_OCERW_CHBUFEN0                  (*((volatile unsigned int*)(0x42490440UL)))
#define bM4_TMR42_OCERW_CHBUFEN1                  (*((volatile unsigned int*)(0x42490444UL)))
#define bM4_TMR42_OCERW_CLBUFEN0                  (*((volatile unsigned int*)(0x42490448UL)))
#define bM4_TMR42_OCERW_CLBUFEN1                  (*((volatile unsigned int*)(0x4249044CUL)))
#define bM4_TMR42_OCERW_MHBUFEN0                  (*((volatile unsigned int*)(0x42490450UL)))
#define bM4_TMR42_OCERW_MHBUFEN1                  (*((volatile unsigned int*)(0x42490454UL)))
#define bM4_TMR42_OCERW_MLBUFEN0                  (*((volatile unsigned int*)(0x42490458UL)))
#define bM4_TMR42_OCERW_MLBUFEN1                  (*((volatile unsigned int*)(0x4249045CUL)))
#define bM4_TMR42_OCERW_LMCH                      (*((volatile unsigned int*)(0x42490460UL)))
#define bM4_TMR42_OCERW_LMCL                      (*((volatile unsigned int*)(0x42490464UL)))
#define bM4_TMR42_OCERW_LMMH                      (*((volatile unsigned int*)(0x42490468UL)))
#define bM4_TMR42_OCERW_LMML                      (*((volatile unsigned int*)(0x4249046CUL)))
#define bM4_TMR42_OCERW_MCECH                     (*((volatile unsigned int*)(0x42490470UL)))
#define bM4_TMR42_OCERW_MCECL                     (*((volatile unsigned int*)(0x42490474UL)))
#define bM4_TMR42_OCMRHUH_OCFDCH                  (*((volatile unsigned int*)(0x42490480UL)))
#define bM4_TMR42_OCMRHUH_OCFPKH                  (*((volatile unsigned int*)(0x42490484UL)))
#define bM4_TMR42_OCMRHUH_OCFUCH                  (*((volatile unsigned int*)(0x42490488UL)))
#define bM4_TMR42_OCMRHUH_OCFZRH                  (*((volatile unsigned int*)(0x4249048CUL)))
#define bM4_TMR42_OCMRHUH_OPDCH0                  (*((volatile unsigned int*)(0x42490490UL)))
#define bM4_TMR42_OCMRHUH_OPDCH1                  (*((volatile unsigned int*)(0x42490494UL)))
#define bM4_TMR42_OCMRHUH_OPPKH0                  (*((volatile unsigned int*)(0x42490498UL)))
#define bM4_TMR42_OCMRHUH_OPPKH1                  (*((volatile unsigned int*)(0x4249049CUL)))
#define bM4_TMR42_OCMRHUH_OPUCH0                  (*((volatile unsigned int*)(0x424904A0UL)))
#define bM4_TMR42_OCMRHUH_OPUCH1                  (*((volatile unsigned int*)(0x424904A4UL)))
#define bM4_TMR42_OCMRHUH_OPZRH0                  (*((volatile unsigned int*)(0x424904A8UL)))
#define bM4_TMR42_OCMRHUH_OPZRH1                  (*((volatile unsigned int*)(0x424904ACUL)))
#define bM4_TMR42_OCMRHUH_OPNPKH0                 (*((volatile unsigned int*)(0x424904B0UL)))
#define bM4_TMR42_OCMRHUH_OPNPKH1                 (*((volatile unsigned int*)(0x424904B4UL)))
#define bM4_TMR42_OCMRHUH_OPNZRH0                 (*((volatile unsigned int*)(0x424904B8UL)))
#define bM4_TMR42_OCMRHUH_OPNZRH1                 (*((volatile unsigned int*)(0x424904BCUL)))
#define bM4_TMR42_OCMRLUL_OCFDCL                  (*((volatile unsigned int*)(0x42490500UL)))
#define bM4_TMR42_OCMRLUL_OCFPKL                  (*((volatile unsigned int*)(0x42490504UL)))
#define bM4_TMR42_OCMRLUL_OCFUCL                  (*((volatile unsigned int*)(0x42490508UL)))
#define bM4_TMR42_OCMRLUL_OCFZRL                  (*((volatile unsigned int*)(0x4249050CUL)))
#define bM4_TMR42_OCMRLUL_OPDCL0                  (*((volatile unsigned int*)(0x42490510UL)))
#define bM4_TMR42_OCMRLUL_OPDCL1                  (*((volatile unsigned int*)(0x42490514UL)))
#define bM4_TMR42_OCMRLUL_OPPKL0                  (*((volatile unsigned int*)(0x42490518UL)))
#define bM4_TMR42_OCMRLUL_OPPKL1                  (*((volatile unsigned int*)(0x4249051CUL)))
#define bM4_TMR42_OCMRLUL_OPUCL0                  (*((volatile unsigned int*)(0x42490520UL)))
#define bM4_TMR42_OCMRLUL_OPUCL1                  (*((volatile unsigned int*)(0x42490524UL)))
#define bM4_TMR42_OCMRLUL_OPZRL0                  (*((volatile unsigned int*)(0x42490528UL)))
#define bM4_TMR42_OCMRLUL_OPZRL1                  (*((volatile unsigned int*)(0x4249052CUL)))
#define bM4_TMR42_OCMRLUL_OPNPKL0                 (*((volatile unsigned int*)(0x42490530UL)))
#define bM4_TMR42_OCMRLUL_OPNPKL1                 (*((volatile unsigned int*)(0x42490534UL)))
#define bM4_TMR42_OCMRLUL_OPNZRL0                 (*((volatile unsigned int*)(0x42490538UL)))
#define bM4_TMR42_OCMRLUL_OPNZRL1                 (*((volatile unsigned int*)(0x4249053CUL)))
#define bM4_TMR42_OCMRLUL_EOPNDCL0                (*((volatile unsigned int*)(0x42490540UL)))
#define bM4_TMR42_OCMRLUL_EOPNDCL1                (*((volatile unsigned int*)(0x42490544UL)))
#define bM4_TMR42_OCMRLUL_EOPNUCL0                (*((volatile unsigned int*)(0x42490548UL)))
#define bM4_TMR42_OCMRLUL_EOPNUCL1                (*((volatile unsigned int*)(0x4249054CUL)))
#define bM4_TMR42_OCMRLUL_EOPDCL0                 (*((volatile unsigned int*)(0x42490550UL)))
#define bM4_TMR42_OCMRLUL_EOPDCL1                 (*((volatile unsigned int*)(0x42490554UL)))
#define bM4_TMR42_OCMRLUL_EOPPKL0                 (*((volatile unsigned int*)(0x42490558UL)))
#define bM4_TMR42_OCMRLUL_EOPPKL1                 (*((volatile unsigned int*)(0x4249055CUL)))
#define bM4_TMR42_OCMRLUL_EOPUCL0                 (*((volatile unsigned int*)(0x42490560UL)))
#define bM4_TMR42_OCMRLUL_EOPUCL1                 (*((volatile unsigned int*)(0x42490564UL)))
#define bM4_TMR42_OCMRLUL_EOPZRL0                 (*((volatile unsigned int*)(0x42490568UL)))
#define bM4_TMR42_OCMRLUL_EOPZRL1                 (*((volatile unsigned int*)(0x4249056CUL)))
#define bM4_TMR42_OCMRLUL_EOPNPKL0                (*((volatile unsigned int*)(0x42490570UL)))
#define bM4_TMR42_OCMRLUL_EOPNPKL1                (*((volatile unsigned int*)(0x42490574UL)))
#define bM4_TMR42_OCMRLUL_EOPNZRL0                (*((volatile unsigned int*)(0x42490578UL)))
#define bM4_TMR42_OCMRLUL_EOPNZRL1                (*((volatile unsigned int*)(0x4249057CUL)))
#define bM4_TMR42_OCMRHVH_OCFDCH                  (*((volatile unsigned int*)(0x42490580UL)))
#define bM4_TMR42_OCMRHVH_OCFPKH                  (*((volatile unsigned int*)(0x42490584UL)))
#define bM4_TMR42_OCMRHVH_OCFUCH                  (*((volatile unsigned int*)(0x42490588UL)))
#define bM4_TMR42_OCMRHVH_OCFZRH                  (*((volatile unsigned int*)(0x4249058CUL)))
#define bM4_TMR42_OCMRHVH_OPDCH0                  (*((volatile unsigned int*)(0x42490590UL)))
#define bM4_TMR42_OCMRHVH_OPDCH1                  (*((volatile unsigned int*)(0x42490594UL)))
#define bM4_TMR42_OCMRHVH_OPPKH0                  (*((volatile unsigned int*)(0x42490598UL)))
#define bM4_TMR42_OCMRHVH_OPPKH1                  (*((volatile unsigned int*)(0x4249059CUL)))
#define bM4_TMR42_OCMRHVH_OPUCH0                  (*((volatile unsigned int*)(0x424905A0UL)))
#define bM4_TMR42_OCMRHVH_OPUCH1                  (*((volatile unsigned int*)(0x424905A4UL)))
#define bM4_TMR42_OCMRHVH_OPZRH0                  (*((volatile unsigned int*)(0x424905A8UL)))
#define bM4_TMR42_OCMRHVH_OPZRH1                  (*((volatile unsigned int*)(0x424905ACUL)))
#define bM4_TMR42_OCMRHVH_OPNPKH0                 (*((volatile unsigned int*)(0x424905B0UL)))
#define bM4_TMR42_OCMRHVH_OPNPKH1                 (*((volatile unsigned int*)(0x424905B4UL)))
#define bM4_TMR42_OCMRHVH_OPNZRH0                 (*((volatile unsigned int*)(0x424905B8UL)))
#define bM4_TMR42_OCMRHVH_OPNZRH1                 (*((volatile unsigned int*)(0x424905BCUL)))
#define bM4_TMR42_OCMRLVL_OCFDCL                  (*((volatile unsigned int*)(0x42490600UL)))
#define bM4_TMR42_OCMRLVL_OCFPKL                  (*((volatile unsigned int*)(0x42490604UL)))
#define bM4_TMR42_OCMRLVL_OCFUCL                  (*((volatile unsigned int*)(0x42490608UL)))
#define bM4_TMR42_OCMRLVL_OCFZRL                  (*((volatile unsigned int*)(0x4249060CUL)))
#define bM4_TMR42_OCMRLVL_OPDCL0                  (*((volatile unsigned int*)(0x42490610UL)))
#define bM4_TMR42_OCMRLVL_OPDCL1                  (*((volatile unsigned int*)(0x42490614UL)))
#define bM4_TMR42_OCMRLVL_OPPKL0                  (*((volatile unsigned int*)(0x42490618UL)))
#define bM4_TMR42_OCMRLVL_OPPKL1                  (*((volatile unsigned int*)(0x4249061CUL)))
#define bM4_TMR42_OCMRLVL_OPUCL0                  (*((volatile unsigned int*)(0x42490620UL)))
#define bM4_TMR42_OCMRLVL_OPUCL1                  (*((volatile unsigned int*)(0x42490624UL)))
#define bM4_TMR42_OCMRLVL_OPZRL0                  (*((volatile unsigned int*)(0x42490628UL)))
#define bM4_TMR42_OCMRLVL_OPZRL1                  (*((volatile unsigned int*)(0x4249062CUL)))
#define bM4_TMR42_OCMRLVL_OPNPKL0                 (*((volatile unsigned int*)(0x42490630UL)))
#define bM4_TMR42_OCMRLVL_OPNPKL1                 (*((volatile unsigned int*)(0x42490634UL)))
#define bM4_TMR42_OCMRLVL_OPNZRL0                 (*((volatile unsigned int*)(0x42490638UL)))
#define bM4_TMR42_OCMRLVL_OPNZRL1                 (*((volatile unsigned int*)(0x4249063CUL)))
#define bM4_TMR42_OCMRLVL_EOPNDCL0                (*((volatile unsigned int*)(0x42490640UL)))
#define bM4_TMR42_OCMRLVL_EOPNDCL1                (*((volatile unsigned int*)(0x42490644UL)))
#define bM4_TMR42_OCMRLVL_EOPNUCL0                (*((volatile unsigned int*)(0x42490648UL)))
#define bM4_TMR42_OCMRLVL_EOPNUCL1                (*((volatile unsigned int*)(0x4249064CUL)))
#define bM4_TMR42_OCMRLVL_EOPDCL0                 (*((volatile unsigned int*)(0x42490650UL)))
#define bM4_TMR42_OCMRLVL_EOPDCL1                 (*((volatile unsigned int*)(0x42490654UL)))
#define bM4_TMR42_OCMRLVL_EOPPKL0                 (*((volatile unsigned int*)(0x42490658UL)))
#define bM4_TMR42_OCMRLVL_EOPPKL1                 (*((volatile unsigned int*)(0x4249065CUL)))
#define bM4_TMR42_OCMRLVL_EOPUCL0                 (*((volatile unsigned int*)(0x42490660UL)))
#define bM4_TMR42_OCMRLVL_EOPUCL1                 (*((volatile unsigned int*)(0x42490664UL)))
#define bM4_TMR42_OCMRLVL_EOPZRL0                 (*((volatile unsigned int*)(0x42490668UL)))
#define bM4_TMR42_OCMRLVL_EOPZRL1                 (*((volatile unsigned int*)(0x4249066CUL)))
#define bM4_TMR42_OCMRLVL_EOPNPKL0                (*((volatile unsigned int*)(0x42490670UL)))
#define bM4_TMR42_OCMRLVL_EOPNPKL1                (*((volatile unsigned int*)(0x42490674UL)))
#define bM4_TMR42_OCMRLVL_EOPNZRL0                (*((volatile unsigned int*)(0x42490678UL)))
#define bM4_TMR42_OCMRLVL_EOPNZRL1                (*((volatile unsigned int*)(0x4249067CUL)))
#define bM4_TMR42_OCMRHWH_OCFDCH                  (*((volatile unsigned int*)(0x42490680UL)))
#define bM4_TMR42_OCMRHWH_OCFPKH                  (*((volatile unsigned int*)(0x42490684UL)))
#define bM4_TMR42_OCMRHWH_OCFUCH                  (*((volatile unsigned int*)(0x42490688UL)))
#define bM4_TMR42_OCMRHWH_OCFZRH                  (*((volatile unsigned int*)(0x4249068CUL)))
#define bM4_TMR42_OCMRHWH_OPDCH0                  (*((volatile unsigned int*)(0x42490690UL)))
#define bM4_TMR42_OCMRHWH_OPDCH1                  (*((volatile unsigned int*)(0x42490694UL)))
#define bM4_TMR42_OCMRHWH_OPPKH0                  (*((volatile unsigned int*)(0x42490698UL)))
#define bM4_TMR42_OCMRHWH_OPPKH1                  (*((volatile unsigned int*)(0x4249069CUL)))
#define bM4_TMR42_OCMRHWH_OPUCH0                  (*((volatile unsigned int*)(0x424906A0UL)))
#define bM4_TMR42_OCMRHWH_OPUCH1                  (*((volatile unsigned int*)(0x424906A4UL)))
#define bM4_TMR42_OCMRHWH_OPZRH0                  (*((volatile unsigned int*)(0x424906A8UL)))
#define bM4_TMR42_OCMRHWH_OPZRH1                  (*((volatile unsigned int*)(0x424906ACUL)))
#define bM4_TMR42_OCMRHWH_OPNPKH0                 (*((volatile unsigned int*)(0x424906B0UL)))
#define bM4_TMR42_OCMRHWH_OPNPKH1                 (*((volatile unsigned int*)(0x424906B4UL)))
#define bM4_TMR42_OCMRHWH_OPNZRH0                 (*((volatile unsigned int*)(0x424906B8UL)))
#define bM4_TMR42_OCMRHWH_OPNZRH1                 (*((volatile unsigned int*)(0x424906BCUL)))
#define bM4_TMR42_OCMRLWL_OCFDCL                  (*((volatile unsigned int*)(0x42490700UL)))
#define bM4_TMR42_OCMRLWL_OCFPKL                  (*((volatile unsigned int*)(0x42490704UL)))
#define bM4_TMR42_OCMRLWL_OCFUCL                  (*((volatile unsigned int*)(0x42490708UL)))
#define bM4_TMR42_OCMRLWL_OCFZRL                  (*((volatile unsigned int*)(0x4249070CUL)))
#define bM4_TMR42_OCMRLWL_OPDCL0                  (*((volatile unsigned int*)(0x42490710UL)))
#define bM4_TMR42_OCMRLWL_OPDCL1                  (*((volatile unsigned int*)(0x42490714UL)))
#define bM4_TMR42_OCMRLWL_OPPKL0                  (*((volatile unsigned int*)(0x42490718UL)))
#define bM4_TMR42_OCMRLWL_OPPKL1                  (*((volatile unsigned int*)(0x4249071CUL)))
#define bM4_TMR42_OCMRLWL_OPUCL0                  (*((volatile unsigned int*)(0x42490720UL)))
#define bM4_TMR42_OCMRLWL_OPUCL1                  (*((volatile unsigned int*)(0x42490724UL)))
#define bM4_TMR42_OCMRLWL_OPZRL0                  (*((volatile unsigned int*)(0x42490728UL)))
#define bM4_TMR42_OCMRLWL_OPZRL1                  (*((volatile unsigned int*)(0x4249072CUL)))
#define bM4_TMR42_OCMRLWL_OPNPKL0                 (*((volatile unsigned int*)(0x42490730UL)))
#define bM4_TMR42_OCMRLWL_OPNPKL1                 (*((volatile unsigned int*)(0x42490734UL)))
#define bM4_TMR42_OCMRLWL_OPNZRL0                 (*((volatile unsigned int*)(0x42490738UL)))
#define bM4_TMR42_OCMRLWL_OPNZRL1                 (*((volatile unsigned int*)(0x4249073CUL)))
#define bM4_TMR42_OCMRLWL_EOPNDCL0                (*((volatile unsigned int*)(0x42490740UL)))
#define bM4_TMR42_OCMRLWL_EOPNDCL1                (*((volatile unsigned int*)(0x42490744UL)))
#define bM4_TMR42_OCMRLWL_EOPNUCL0                (*((volatile unsigned int*)(0x42490748UL)))
#define bM4_TMR42_OCMRLWL_EOPNUCL1                (*((volatile unsigned int*)(0x4249074CUL)))
#define bM4_TMR42_OCMRLWL_EOPDCL0                 (*((volatile unsigned int*)(0x42490750UL)))
#define bM4_TMR42_OCMRLWL_EOPDCL1                 (*((volatile unsigned int*)(0x42490754UL)))
#define bM4_TMR42_OCMRLWL_EOPPKL0                 (*((volatile unsigned int*)(0x42490758UL)))
#define bM4_TMR42_OCMRLWL_EOPPKL1                 (*((volatile unsigned int*)(0x4249075CUL)))
#define bM4_TMR42_OCMRLWL_EOPUCL0                 (*((volatile unsigned int*)(0x42490760UL)))
#define bM4_TMR42_OCMRLWL_EOPUCL1                 (*((volatile unsigned int*)(0x42490764UL)))
#define bM4_TMR42_OCMRLWL_EOPZRL0                 (*((volatile unsigned int*)(0x42490768UL)))
#define bM4_TMR42_OCMRLWL_EOPZRL1                 (*((volatile unsigned int*)(0x4249076CUL)))
#define bM4_TMR42_OCMRLWL_EOPNPKL0                (*((volatile unsigned int*)(0x42490770UL)))
#define bM4_TMR42_OCMRLWL_EOPNPKL1                (*((volatile unsigned int*)(0x42490774UL)))
#define bM4_TMR42_OCMRLWL_EOPNZRL0                (*((volatile unsigned int*)(0x42490778UL)))
#define bM4_TMR42_OCMRLWL_EOPNZRL1                (*((volatile unsigned int*)(0x4249077CUL)))
#define bM4_TMR42_CCSR_CKDIV0                     (*((volatile unsigned int*)(0x42490900UL)))
#define bM4_TMR42_CCSR_CKDIV1                     (*((volatile unsigned int*)(0x42490904UL)))
#define bM4_TMR42_CCSR_CKDIV2                     (*((volatile unsigned int*)(0x42490908UL)))
#define bM4_TMR42_CCSR_CKDIV3                     (*((volatile unsigned int*)(0x4249090CUL)))
#define bM4_TMR42_CCSR_CLEAR                      (*((volatile unsigned int*)(0x42490910UL)))
#define bM4_TMR42_CCSR_MODE                       (*((volatile unsigned int*)(0x42490914UL)))
#define bM4_TMR42_CCSR_STOP                       (*((volatile unsigned int*)(0x42490918UL)))
#define bM4_TMR42_CCSR_BUFEN                      (*((volatile unsigned int*)(0x4249091CUL)))
#define bM4_TMR42_CCSR_IRQPEN                     (*((volatile unsigned int*)(0x42490920UL)))
#define bM4_TMR42_CCSR_IRQPF                      (*((volatile unsigned int*)(0x42490924UL)))
#define bM4_TMR42_CCSR_IRQZEN                     (*((volatile unsigned int*)(0x42490934UL)))
#define bM4_TMR42_CCSR_IRQZF                      (*((volatile unsigned int*)(0x42490938UL)))
#define bM4_TMR42_CCSR_ECKEN                      (*((volatile unsigned int*)(0x4249093CUL)))
#define bM4_TMR42_CVPR_ZIM0                       (*((volatile unsigned int*)(0x42490940UL)))
#define bM4_TMR42_CVPR_ZIM1                       (*((volatile unsigned int*)(0x42490944UL)))
#define bM4_TMR42_CVPR_ZIM2                       (*((volatile unsigned int*)(0x42490948UL)))
#define bM4_TMR42_CVPR_ZIM3                       (*((volatile unsigned int*)(0x4249094CUL)))
#define bM4_TMR42_CVPR_PIM0                       (*((volatile unsigned int*)(0x42490950UL)))
#define bM4_TMR42_CVPR_PIM1                       (*((volatile unsigned int*)(0x42490954UL)))
#define bM4_TMR42_CVPR_PIM2                       (*((volatile unsigned int*)(0x42490958UL)))
#define bM4_TMR42_CVPR_PIM3                       (*((volatile unsigned int*)(0x4249095CUL)))
#define bM4_TMR42_CVPR_ZIC0                       (*((volatile unsigned int*)(0x42490960UL)))
#define bM4_TMR42_CVPR_ZIC1                       (*((volatile unsigned int*)(0x42490964UL)))
#define bM4_TMR42_CVPR_ZIC2                       (*((volatile unsigned int*)(0x42490968UL)))
#define bM4_TMR42_CVPR_ZIC3                       (*((volatile unsigned int*)(0x4249096CUL)))
#define bM4_TMR42_CVPR_PIC0                       (*((volatile unsigned int*)(0x42490970UL)))
#define bM4_TMR42_CVPR_PIC1                       (*((volatile unsigned int*)(0x42490974UL)))
#define bM4_TMR42_CVPR_PIC2                       (*((volatile unsigned int*)(0x42490978UL)))
#define bM4_TMR42_CVPR_PIC3                       (*((volatile unsigned int*)(0x4249097CUL)))
#define bM4_TMR42_POCRU_DIVCK0                    (*((volatile unsigned int*)(0x42491300UL)))
#define bM4_TMR42_POCRU_DIVCK1                    (*((volatile unsigned int*)(0x42491304UL)))
#define bM4_TMR42_POCRU_DIVCK2                    (*((volatile unsigned int*)(0x42491308UL)))
#define bM4_TMR42_POCRU_DIVCK3                    (*((volatile unsigned int*)(0x4249130CUL)))
#define bM4_TMR42_POCRU_PWMMD0                    (*((volatile unsigned int*)(0x42491310UL)))
#define bM4_TMR42_POCRU_PWMMD1                    (*((volatile unsigned int*)(0x42491314UL)))
#define bM4_TMR42_POCRU_LVLS0                     (*((volatile unsigned int*)(0x42491318UL)))
#define bM4_TMR42_POCRU_LVLS1                     (*((volatile unsigned int*)(0x4249131CUL)))
#define bM4_TMR42_POCRV_DIVCK0                    (*((volatile unsigned int*)(0x42491380UL)))
#define bM4_TMR42_POCRV_DIVCK1                    (*((volatile unsigned int*)(0x42491384UL)))
#define bM4_TMR42_POCRV_DIVCK2                    (*((volatile unsigned int*)(0x42491388UL)))
#define bM4_TMR42_POCRV_DIVCK3                    (*((volatile unsigned int*)(0x4249138CUL)))
#define bM4_TMR42_POCRV_PWMMD0                    (*((volatile unsigned int*)(0x42491390UL)))
#define bM4_TMR42_POCRV_PWMMD1                    (*((volatile unsigned int*)(0x42491394UL)))
#define bM4_TMR42_POCRV_LVLS0                     (*((volatile unsigned int*)(0x42491398UL)))
#define bM4_TMR42_POCRV_LVLS1                     (*((volatile unsigned int*)(0x4249139CUL)))
#define bM4_TMR42_POCRW_DIVCK0                    (*((volatile unsigned int*)(0x42491400UL)))
