thtfcccj/CMSIS/hc32f46xb.h
#define bM4_TMRA2_PCONR2_FORC1                    (*((volatile unsigned int*)(0x422AA8A4UL)))
#define bM4_TMRA2_PCONR2_OUTEN                    (*((volatile unsigned int*)(0x422AA8B0UL)))
#define bM4_TMRA2_PCONR3_STAC0                    (*((volatile unsigned int*)(0x422AA900UL)))
#define bM4_TMRA2_PCONR3_STAC1                    (*((volatile unsigned int*)(0x422AA904UL)))
#define bM4_TMRA2_PCONR3_STPC0                    (*((volatile unsigned int*)(0x422AA908UL)))
#define bM4_TMRA2_PCONR3_STPC1                    (*((volatile unsigned int*)(0x422AA90CUL)))
#define bM4_TMRA2_PCONR3_CMPC0                    (*((volatile unsigned int*)(0x422AA910UL)))
#define bM4_TMRA2_PCONR3_CMPC1                    (*((volatile unsigned int*)(0x422AA914UL)))
#define bM4_TMRA2_PCONR3_PERC0                    (*((volatile unsigned int*)(0x422AA918UL)))
#define bM4_TMRA2_PCONR3_PERC1                    (*((volatile unsigned int*)(0x422AA91CUL)))
#define bM4_TMRA2_PCONR3_FORC0                    (*((volatile unsigned int*)(0x422AA920UL)))
#define bM4_TMRA2_PCONR3_FORC1                    (*((volatile unsigned int*)(0x422AA924UL)))
#define bM4_TMRA2_PCONR3_OUTEN                    (*((volatile unsigned int*)(0x422AA930UL)))
#define bM4_TMRA2_PCONR4_STAC0                    (*((volatile unsigned int*)(0x422AA980UL)))
#define bM4_TMRA2_PCONR4_STAC1                    (*((volatile unsigned int*)(0x422AA984UL)))
#define bM4_TMRA2_PCONR4_STPC0                    (*((volatile unsigned int*)(0x422AA988UL)))
#define bM4_TMRA2_PCONR4_STPC1                    (*((volatile unsigned int*)(0x422AA98CUL)))
#define bM4_TMRA2_PCONR4_CMPC0                    (*((volatile unsigned int*)(0x422AA990UL)))
#define bM4_TMRA2_PCONR4_CMPC1                    (*((volatile unsigned int*)(0x422AA994UL)))
#define bM4_TMRA2_PCONR4_PERC0                    (*((volatile unsigned int*)(0x422AA998UL)))
#define bM4_TMRA2_PCONR4_PERC1                    (*((volatile unsigned int*)(0x422AA99CUL)))
#define bM4_TMRA2_PCONR4_FORC0                    (*((volatile unsigned int*)(0x422AA9A0UL)))
#define bM4_TMRA2_PCONR4_FORC1                    (*((volatile unsigned int*)(0x422AA9A4UL)))
#define bM4_TMRA2_PCONR4_OUTEN                    (*((volatile unsigned int*)(0x422AA9B0UL)))
#define bM4_TMRA2_PCONR5_STAC0                    (*((volatile unsigned int*)(0x422AAA00UL)))
#define bM4_TMRA2_PCONR5_STAC1                    (*((volatile unsigned int*)(0x422AAA04UL)))
#define bM4_TMRA2_PCONR5_STPC0                    (*((volatile unsigned int*)(0x422AAA08UL)))
#define bM4_TMRA2_PCONR5_STPC1                    (*((volatile unsigned int*)(0x422AAA0CUL)))
#define bM4_TMRA2_PCONR5_CMPC0                    (*((volatile unsigned int*)(0x422AAA10UL)))
#define bM4_TMRA2_PCONR5_CMPC1                    (*((volatile unsigned int*)(0x422AAA14UL)))
#define bM4_TMRA2_PCONR5_PERC0                    (*((volatile unsigned int*)(0x422AAA18UL)))
#define bM4_TMRA2_PCONR5_PERC1                    (*((volatile unsigned int*)(0x422AAA1CUL)))
#define bM4_TMRA2_PCONR5_FORC0                    (*((volatile unsigned int*)(0x422AAA20UL)))
#define bM4_TMRA2_PCONR5_FORC1                    (*((volatile unsigned int*)(0x422AAA24UL)))
#define bM4_TMRA2_PCONR5_OUTEN                    (*((volatile unsigned int*)(0x422AAA30UL)))
#define bM4_TMRA2_PCONR6_STAC0                    (*((volatile unsigned int*)(0x422AAA80UL)))
#define bM4_TMRA2_PCONR6_STAC1                    (*((volatile unsigned int*)(0x422AAA84UL)))
#define bM4_TMRA2_PCONR6_STPC0                    (*((volatile unsigned int*)(0x422AAA88UL)))
#define bM4_TMRA2_PCONR6_STPC1                    (*((volatile unsigned int*)(0x422AAA8CUL)))
#define bM4_TMRA2_PCONR6_CMPC0                    (*((volatile unsigned int*)(0x422AAA90UL)))
#define bM4_TMRA2_PCONR6_CMPC1                    (*((volatile unsigned int*)(0x422AAA94UL)))
#define bM4_TMRA2_PCONR6_PERC0                    (*((volatile unsigned int*)(0x422AAA98UL)))
#define bM4_TMRA2_PCONR6_PERC1                    (*((volatile unsigned int*)(0x422AAA9CUL)))
#define bM4_TMRA2_PCONR6_FORC0                    (*((volatile unsigned int*)(0x422AAAA0UL)))
#define bM4_TMRA2_PCONR6_FORC1                    (*((volatile unsigned int*)(0x422AAAA4UL)))
#define bM4_TMRA2_PCONR6_OUTEN                    (*((volatile unsigned int*)(0x422AAAB0UL)))
#define bM4_TMRA2_PCONR7_STAC0                    (*((volatile unsigned int*)(0x422AAB00UL)))
#define bM4_TMRA2_PCONR7_STAC1                    (*((volatile unsigned int*)(0x422AAB04UL)))
#define bM4_TMRA2_PCONR7_STPC0                    (*((volatile unsigned int*)(0x422AAB08UL)))
#define bM4_TMRA2_PCONR7_STPC1                    (*((volatile unsigned int*)(0x422AAB0CUL)))
#define bM4_TMRA2_PCONR7_CMPC0                    (*((volatile unsigned int*)(0x422AAB10UL)))
#define bM4_TMRA2_PCONR7_CMPC1                    (*((volatile unsigned int*)(0x422AAB14UL)))
#define bM4_TMRA2_PCONR7_PERC0                    (*((volatile unsigned int*)(0x422AAB18UL)))
#define bM4_TMRA2_PCONR7_PERC1                    (*((volatile unsigned int*)(0x422AAB1CUL)))
#define bM4_TMRA2_PCONR7_FORC0                    (*((volatile unsigned int*)(0x422AAB20UL)))
#define bM4_TMRA2_PCONR7_FORC1                    (*((volatile unsigned int*)(0x422AAB24UL)))
#define bM4_TMRA2_PCONR7_OUTEN                    (*((volatile unsigned int*)(0x422AAB30UL)))
#define bM4_TMRA2_PCONR8_STAC0                    (*((volatile unsigned int*)(0x422AAB80UL)))
#define bM4_TMRA2_PCONR8_STAC1                    (*((volatile unsigned int*)(0x422AAB84UL)))
#define bM4_TMRA2_PCONR8_STPC0                    (*((volatile unsigned int*)(0x422AAB88UL)))
#define bM4_TMRA2_PCONR8_STPC1                    (*((volatile unsigned int*)(0x422AAB8CUL)))
#define bM4_TMRA2_PCONR8_CMPC0                    (*((volatile unsigned int*)(0x422AAB90UL)))
#define bM4_TMRA2_PCONR8_CMPC1                    (*((volatile unsigned int*)(0x422AAB94UL)))
#define bM4_TMRA2_PCONR8_PERC0                    (*((volatile unsigned int*)(0x422AAB98UL)))
#define bM4_TMRA2_PCONR8_PERC1                    (*((volatile unsigned int*)(0x422AAB9CUL)))
#define bM4_TMRA2_PCONR8_FORC0                    (*((volatile unsigned int*)(0x422AABA0UL)))
#define bM4_TMRA2_PCONR8_FORC1                    (*((volatile unsigned int*)(0x422AABA4UL)))
#define bM4_TMRA2_PCONR8_OUTEN                    (*((volatile unsigned int*)(0x422AABB0UL)))
#define bM4_TMRA3_CNTER_CNT0                      (*((volatile unsigned int*)(0x422B0000UL)))
#define bM4_TMRA3_CNTER_CNT1                      (*((volatile unsigned int*)(0x422B0004UL)))
#define bM4_TMRA3_CNTER_CNT2                      (*((volatile unsigned int*)(0x422B0008UL)))
#define bM4_TMRA3_CNTER_CNT3                      (*((volatile unsigned int*)(0x422B000CUL)))
#define bM4_TMRA3_CNTER_CNT4                      (*((volatile unsigned int*)(0x422B0010UL)))
#define bM4_TMRA3_CNTER_CNT5                      (*((volatile unsigned int*)(0x422B0014UL)))
#define bM4_TMRA3_CNTER_CNT6                      (*((volatile unsigned int*)(0x422B0018UL)))
#define bM4_TMRA3_CNTER_CNT7                      (*((volatile unsigned int*)(0x422B001CUL)))
#define bM4_TMRA3_CNTER_CNT8                      (*((volatile unsigned int*)(0x422B0020UL)))
#define bM4_TMRA3_CNTER_CNT9                      (*((volatile unsigned int*)(0x422B0024UL)))
#define bM4_TMRA3_CNTER_CNT10                     (*((volatile unsigned int*)(0x422B0028UL)))
#define bM4_TMRA3_CNTER_CNT11                     (*((volatile unsigned int*)(0x422B002CUL)))
#define bM4_TMRA3_CNTER_CNT12                     (*((volatile unsigned int*)(0x422B0030UL)))
#define bM4_TMRA3_CNTER_CNT13                     (*((volatile unsigned int*)(0x422B0034UL)))
#define bM4_TMRA3_CNTER_CNT14                     (*((volatile unsigned int*)(0x422B0038UL)))
#define bM4_TMRA3_CNTER_CNT15                     (*((volatile unsigned int*)(0x422B003CUL)))
#define bM4_TMRA3_PERAR_PER0                      (*((volatile unsigned int*)(0x422B0080UL)))
#define bM4_TMRA3_PERAR_PER1                      (*((volatile unsigned int*)(0x422B0084UL)))
#define bM4_TMRA3_PERAR_PER2                      (*((volatile unsigned int*)(0x422B0088UL)))
#define bM4_TMRA3_PERAR_PER3                      (*((volatile unsigned int*)(0x422B008CUL)))
#define bM4_TMRA3_PERAR_PER4                      (*((volatile unsigned int*)(0x422B0090UL)))
#define bM4_TMRA3_PERAR_PER5                      (*((volatile unsigned int*)(0x422B0094UL)))
#define bM4_TMRA3_PERAR_PER6                      (*((volatile unsigned int*)(0x422B0098UL)))
#define bM4_TMRA3_PERAR_PER7                      (*((volatile unsigned int*)(0x422B009CUL)))
#define bM4_TMRA3_PERAR_PER8                      (*((volatile unsigned int*)(0x422B00A0UL)))
#define bM4_TMRA3_PERAR_PER9                      (*((volatile unsigned int*)(0x422B00A4UL)))
#define bM4_TMRA3_PERAR_PER10                     (*((volatile unsigned int*)(0x422B00A8UL)))
#define bM4_TMRA3_PERAR_PER11                     (*((volatile unsigned int*)(0x422B00ACUL)))
#define bM4_TMRA3_PERAR_PER12                     (*((volatile unsigned int*)(0x422B00B0UL)))
#define bM4_TMRA3_PERAR_PER13                     (*((volatile unsigned int*)(0x422B00B4UL)))
#define bM4_TMRA3_PERAR_PER14                     (*((volatile unsigned int*)(0x422B00B8UL)))
#define bM4_TMRA3_PERAR_PER15                     (*((volatile unsigned int*)(0x422B00BCUL)))
#define bM4_TMRA3_CMPAR1_CMP0                     (*((volatile unsigned int*)(0x422B0800UL)))
#define bM4_TMRA3_CMPAR1_CMP1                     (*((volatile unsigned int*)(0x422B0804UL)))
#define bM4_TMRA3_CMPAR1_CMP2                     (*((volatile unsigned int*)(0x422B0808UL)))
#define bM4_TMRA3_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422B080CUL)))
#define bM4_TMRA3_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422B0810UL)))
#define bM4_TMRA3_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422B0814UL)))
#define bM4_TMRA3_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422B0818UL)))
#define bM4_TMRA3_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422B081CUL)))
#define bM4_TMRA3_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422B0820UL)))
#define bM4_TMRA3_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422B0824UL)))
#define bM4_TMRA3_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422B0828UL)))
#define bM4_TMRA3_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422B082CUL)))
#define bM4_TMRA3_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422B0830UL)))
#define bM4_TMRA3_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422B0834UL)))
#define bM4_TMRA3_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422B0838UL)))
#define bM4_TMRA3_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422B083CUL)))
#define bM4_TMRA3_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422B0880UL)))
#define bM4_TMRA3_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422B0884UL)))
#define bM4_TMRA3_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422B0888UL)))
#define bM4_TMRA3_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422B088CUL)))
#define bM4_TMRA3_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422B0890UL)))
#define bM4_TMRA3_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422B0894UL)))
#define bM4_TMRA3_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422B0898UL)))
#define bM4_TMRA3_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422B089CUL)))
#define bM4_TMRA3_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422B08A0UL)))
#define bM4_TMRA3_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422B08A4UL)))
#define bM4_TMRA3_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422B08A8UL)))
#define bM4_TMRA3_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422B08ACUL)))
#define bM4_TMRA3_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422B08B0UL)))
#define bM4_TMRA3_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422B08B4UL)))
#define bM4_TMRA3_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422B08B8UL)))
#define bM4_TMRA3_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422B08BCUL)))
#define bM4_TMRA3_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422B0900UL)))
#define bM4_TMRA3_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422B0904UL)))
#define bM4_TMRA3_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422B0908UL)))
#define bM4_TMRA3_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422B090CUL)))
#define bM4_TMRA3_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422B0910UL)))
#define bM4_TMRA3_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422B0914UL)))
#define bM4_TMRA3_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422B0918UL)))
#define bM4_TMRA3_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422B091CUL)))
#define bM4_TMRA3_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422B0920UL)))
#define bM4_TMRA3_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422B0924UL)))
#define bM4_TMRA3_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422B0928UL)))
#define bM4_TMRA3_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422B092CUL)))
#define bM4_TMRA3_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422B0930UL)))
#define bM4_TMRA3_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422B0934UL)))
#define bM4_TMRA3_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422B0938UL)))
#define bM4_TMRA3_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422B093CUL)))
#define bM4_TMRA3_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422B0980UL)))
#define bM4_TMRA3_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422B0984UL)))
#define bM4_TMRA3_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422B0988UL)))
#define bM4_TMRA3_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422B098CUL)))
#define bM4_TMRA3_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422B0990UL)))
#define bM4_TMRA3_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422B0994UL)))
#define bM4_TMRA3_CMPAR4_CMP6                     (*((volatile unsigned int*)(0x422B0998UL)))
#define bM4_TMRA3_CMPAR4_CMP7                     (*((volatile unsigned int*)(0x422B099CUL)))
#define bM4_TMRA3_CMPAR4_CMP8                     (*((volatile unsigned int*)(0x422B09A0UL)))
#define bM4_TMRA3_CMPAR4_CMP9                     (*((volatile unsigned int*)(0x422B09A4UL)))
#define bM4_TMRA3_CMPAR4_CMP10                    (*((volatile unsigned int*)(0x422B09A8UL)))
#define bM4_TMRA3_CMPAR4_CMP11                    (*((volatile unsigned int*)(0x422B09ACUL)))
#define bM4_TMRA3_CMPAR4_CMP12                    (*((volatile unsigned int*)(0x422B09B0UL)))
#define bM4_TMRA3_CMPAR4_CMP13                    (*((volatile unsigned int*)(0x422B09B4UL)))
#define bM4_TMRA3_CMPAR4_CMP14                    (*((volatile unsigned int*)(0x422B09B8UL)))
#define bM4_TMRA3_CMPAR4_CMP15                    (*((volatile unsigned int*)(0x422B09BCUL)))
#define bM4_TMRA3_CMPAR5_CMP0                     (*((volatile unsigned int*)(0x422B0A00UL)))
#define bM4_TMRA3_CMPAR5_CMP1                     (*((volatile unsigned int*)(0x422B0A04UL)))
#define bM4_TMRA3_CMPAR5_CMP2                     (*((volatile unsigned int*)(0x422B0A08UL)))
#define bM4_TMRA3_CMPAR5_CMP3                     (*((volatile unsigned int*)(0x422B0A0CUL)))
#define bM4_TMRA3_CMPAR5_CMP4                     (*((volatile unsigned int*)(0x422B0A10UL)))
#define bM4_TMRA3_CMPAR5_CMP5                     (*((volatile unsigned int*)(0x422B0A14UL)))
#define bM4_TMRA3_CMPAR5_CMP6                     (*((volatile unsigned int*)(0x422B0A18UL)))
#define bM4_TMRA3_CMPAR5_CMP7                     (*((volatile unsigned int*)(0x422B0A1CUL)))
#define bM4_TMRA3_CMPAR5_CMP8                     (*((volatile unsigned int*)(0x422B0A20UL)))
#define bM4_TMRA3_CMPAR5_CMP9                     (*((volatile unsigned int*)(0x422B0A24UL)))
#define bM4_TMRA3_CMPAR5_CMP10                    (*((volatile unsigned int*)(0x422B0A28UL)))
#define bM4_TMRA3_CMPAR5_CMP11                    (*((volatile unsigned int*)(0x422B0A2CUL)))
#define bM4_TMRA3_CMPAR5_CMP12                    (*((volatile unsigned int*)(0x422B0A30UL)))
#define bM4_TMRA3_CMPAR5_CMP13                    (*((volatile unsigned int*)(0x422B0A34UL)))
#define bM4_TMRA3_CMPAR5_CMP14                    (*((volatile unsigned int*)(0x422B0A38UL)))
#define bM4_TMRA3_CMPAR5_CMP15                    (*((volatile unsigned int*)(0x422B0A3CUL)))
#define bM4_TMRA3_CMPAR6_CMP0                     (*((volatile unsigned int*)(0x422B0A80UL)))
#define bM4_TMRA3_CMPAR6_CMP1                     (*((volatile unsigned int*)(0x422B0A84UL)))
#define bM4_TMRA3_CMPAR6_CMP2                     (*((volatile unsigned int*)(0x422B0A88UL)))
#define bM4_TMRA3_CMPAR6_CMP3                     (*((volatile unsigned int*)(0x422B0A8CUL)))
#define bM4_TMRA3_CMPAR6_CMP4                     (*((volatile unsigned int*)(0x422B0A90UL)))
#define bM4_TMRA3_CMPAR6_CMP5                     (*((volatile unsigned int*)(0x422B0A94UL)))
#define bM4_TMRA3_CMPAR6_CMP6                     (*((volatile unsigned int*)(0x422B0A98UL)))
#define bM4_TMRA3_CMPAR6_CMP7                     (*((volatile unsigned int*)(0x422B0A9CUL)))
#define bM4_TMRA3_CMPAR6_CMP8                     (*((volatile unsigned int*)(0x422B0AA0UL)))
#define bM4_TMRA3_CMPAR6_CMP9                     (*((volatile unsigned int*)(0x422B0AA4UL)))
#define bM4_TMRA3_CMPAR6_CMP10                    (*((volatile unsigned int*)(0x422B0AA8UL)))
#define bM4_TMRA3_CMPAR6_CMP11                    (*((volatile unsigned int*)(0x422B0AACUL)))
#define bM4_TMRA3_CMPAR6_CMP12                    (*((volatile unsigned int*)(0x422B0AB0UL)))
#define bM4_TMRA3_CMPAR6_CMP13                    (*((volatile unsigned int*)(0x422B0AB4UL)))
#define bM4_TMRA3_CMPAR6_CMP14                    (*((volatile unsigned int*)(0x422B0AB8UL)))
#define bM4_TMRA3_CMPAR6_CMP15                    (*((volatile unsigned int*)(0x422B0ABCUL)))
#define bM4_TMRA3_CMPAR7_CMP0                     (*((volatile unsigned int*)(0x422B0B00UL)))
#define bM4_TMRA3_CMPAR7_CMP1                     (*((volatile unsigned int*)(0x422B0B04UL)))
#define bM4_TMRA3_CMPAR7_CMP2                     (*((volatile unsigned int*)(0x422B0B08UL)))
#define bM4_TMRA3_CMPAR7_CMP3                     (*((volatile unsigned int*)(0x422B0B0CUL)))
#define bM4_TMRA3_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422B0B10UL)))
#define bM4_TMRA3_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422B0B14UL)))
#define bM4_TMRA3_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422B0B18UL)))
#define bM4_TMRA3_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422B0B1CUL)))
#define bM4_TMRA3_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422B0B20UL)))
#define bM4_TMRA3_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422B0B24UL)))
#define bM4_TMRA3_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422B0B28UL)))
#define bM4_TMRA3_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422B0B2CUL)))
#define bM4_TMRA3_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422B0B30UL)))
#define bM4_TMRA3_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422B0B34UL)))
#define bM4_TMRA3_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422B0B38UL)))
#define bM4_TMRA3_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422B0B3CUL)))
#define bM4_TMRA3_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422B0B80UL)))
#define bM4_TMRA3_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422B0B84UL)))
#define bM4_TMRA3_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422B0B88UL)))
#define bM4_TMRA3_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422B0B8CUL)))
#define bM4_TMRA3_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422B0B90UL)))
#define bM4_TMRA3_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422B0B94UL)))
#define bM4_TMRA3_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422B0B98UL)))
#define bM4_TMRA3_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422B0B9CUL)))
#define bM4_TMRA3_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422B0BA0UL)))
#define bM4_TMRA3_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422B0BA4UL)))
#define bM4_TMRA3_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422B0BA8UL)))
#define bM4_TMRA3_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422B0BACUL)))
#define bM4_TMRA3_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422B0BB0UL)))
#define bM4_TMRA3_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422B0BB4UL)))
#define bM4_TMRA3_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422B0BB8UL)))
#define bM4_TMRA3_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422B0BBCUL)))
#define bM4_TMRA3_BCSTR_START                     (*((volatile unsigned int*)(0x422B1000UL)))
#define bM4_TMRA3_BCSTR_DIR                       (*((volatile unsigned int*)(0x422B1004UL)))
#define bM4_TMRA3_BCSTR_MODE                      (*((volatile unsigned int*)(0x422B1008UL)))
#define bM4_TMRA3_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422B100CUL)))
#define bM4_TMRA3_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422B1010UL)))
#define bM4_TMRA3_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422B1014UL)))
#define bM4_TMRA3_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422B1018UL)))
#define bM4_TMRA3_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422B101CUL)))
#define bM4_TMRA3_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422B1030UL)))
#define bM4_TMRA3_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422B1034UL)))
#define bM4_TMRA3_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422B1038UL)))
#define bM4_TMRA3_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422B103CUL)))
#define bM4_TMRA3_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422B1080UL)))
#define bM4_TMRA3_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422B1084UL)))
#define bM4_TMRA3_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422B1088UL)))
#define bM4_TMRA3_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422B1090UL)))
#define bM4_TMRA3_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422B1094UL)))
#define bM4_TMRA3_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422B1098UL)))
#define bM4_TMRA3_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422B10A0UL)))
#define bM4_TMRA3_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422B10A4UL)))
#define bM4_TMRA3_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422B10A8UL)))
#define bM4_TMRA3_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422B10B0UL)))
#define bM4_TMRA3_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422B10B4UL)))
#define bM4_TMRA3_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422B10B8UL)))
#define bM4_TMRA3_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422B10BCUL)))
#define bM4_TMRA3_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422B1100UL)))
#define bM4_TMRA3_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422B1104UL)))
