thtfcccj/CMSIS/hc32f46xb.h
#define bM4_TMRA4_PERAR_PER10                     (*((volatile unsigned int*)(0x422B80A8UL)))
#define bM4_TMRA4_PERAR_PER11                     (*((volatile unsigned int*)(0x422B80ACUL)))
#define bM4_TMRA4_PERAR_PER12                     (*((volatile unsigned int*)(0x422B80B0UL)))
#define bM4_TMRA4_PERAR_PER13                     (*((volatile unsigned int*)(0x422B80B4UL)))
#define bM4_TMRA4_PERAR_PER14                     (*((volatile unsigned int*)(0x422B80B8UL)))
#define bM4_TMRA4_PERAR_PER15                     (*((volatile unsigned int*)(0x422B80BCUL)))
#define bM4_TMRA4_CMPAR1_CMP0                     (*((volatile unsigned int*)(0x422B8800UL)))
#define bM4_TMRA4_CMPAR1_CMP1                     (*((volatile unsigned int*)(0x422B8804UL)))
#define bM4_TMRA4_CMPAR1_CMP2                     (*((volatile unsigned int*)(0x422B8808UL)))
#define bM4_TMRA4_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422B880CUL)))
#define bM4_TMRA4_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422B8810UL)))
#define bM4_TMRA4_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422B8814UL)))
#define bM4_TMRA4_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422B8818UL)))
#define bM4_TMRA4_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422B881CUL)))
#define bM4_TMRA4_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422B8820UL)))
#define bM4_TMRA4_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422B8824UL)))
#define bM4_TMRA4_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422B8828UL)))
#define bM4_TMRA4_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422B882CUL)))
#define bM4_TMRA4_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422B8830UL)))
#define bM4_TMRA4_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422B8834UL)))
#define bM4_TMRA4_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422B8838UL)))
#define bM4_TMRA4_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422B883CUL)))
#define bM4_TMRA4_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422B8880UL)))
#define bM4_TMRA4_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422B8884UL)))
#define bM4_TMRA4_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422B8888UL)))
#define bM4_TMRA4_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422B888CUL)))
#define bM4_TMRA4_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422B8890UL)))
#define bM4_TMRA4_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422B8894UL)))
#define bM4_TMRA4_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422B8898UL)))
#define bM4_TMRA4_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422B889CUL)))
#define bM4_TMRA4_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422B88A0UL)))
#define bM4_TMRA4_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422B88A4UL)))
#define bM4_TMRA4_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422B88A8UL)))
#define bM4_TMRA4_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422B88ACUL)))
#define bM4_TMRA4_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422B88B0UL)))
#define bM4_TMRA4_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422B88B4UL)))
#define bM4_TMRA4_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422B88B8UL)))
#define bM4_TMRA4_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422B88BCUL)))
#define bM4_TMRA4_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422B8900UL)))
#define bM4_TMRA4_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422B8904UL)))
#define bM4_TMRA4_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422B8908UL)))
#define bM4_TMRA4_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422B890CUL)))
#define bM4_TMRA4_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422B8910UL)))
#define bM4_TMRA4_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422B8914UL)))
#define bM4_TMRA4_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422B8918UL)))
#define bM4_TMRA4_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422B891CUL)))
#define bM4_TMRA4_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422B8920UL)))
#define bM4_TMRA4_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422B8924UL)))
#define bM4_TMRA4_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422B8928UL)))
#define bM4_TMRA4_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422B892CUL)))
#define bM4_TMRA4_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422B8930UL)))
#define bM4_TMRA4_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422B8934UL)))
#define bM4_TMRA4_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422B8938UL)))
#define bM4_TMRA4_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422B893CUL)))
#define bM4_TMRA4_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422B8980UL)))
#define bM4_TMRA4_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422B8984UL)))
#define bM4_TMRA4_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422B8988UL)))
#define bM4_TMRA4_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422B898CUL)))
#define bM4_TMRA4_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422B8990UL)))
#define bM4_TMRA4_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422B8994UL)))
#define bM4_TMRA4_CMPAR4_CMP6                     (*((volatile unsigned int*)(0x422B8998UL)))
#define bM4_TMRA4_CMPAR4_CMP7                     (*((volatile unsigned int*)(0x422B899CUL)))
#define bM4_TMRA4_CMPAR4_CMP8                     (*((volatile unsigned int*)(0x422B89A0UL)))
#define bM4_TMRA4_CMPAR4_CMP9                     (*((volatile unsigned int*)(0x422B89A4UL)))
#define bM4_TMRA4_CMPAR4_CMP10                    (*((volatile unsigned int*)(0x422B89A8UL)))
#define bM4_TMRA4_CMPAR4_CMP11                    (*((volatile unsigned int*)(0x422B89ACUL)))
#define bM4_TMRA4_CMPAR4_CMP12                    (*((volatile unsigned int*)(0x422B89B0UL)))
#define bM4_TMRA4_CMPAR4_CMP13                    (*((volatile unsigned int*)(0x422B89B4UL)))
#define bM4_TMRA4_CMPAR4_CMP14                    (*((volatile unsigned int*)(0x422B89B8UL)))
#define bM4_TMRA4_CMPAR4_CMP15                    (*((volatile unsigned int*)(0x422B89BCUL)))
#define bM4_TMRA4_CMPAR5_CMP0                     (*((volatile unsigned int*)(0x422B8A00UL)))
#define bM4_TMRA4_CMPAR5_CMP1                     (*((volatile unsigned int*)(0x422B8A04UL)))
#define bM4_TMRA4_CMPAR5_CMP2                     (*((volatile unsigned int*)(0x422B8A08UL)))
#define bM4_TMRA4_CMPAR5_CMP3                     (*((volatile unsigned int*)(0x422B8A0CUL)))
#define bM4_TMRA4_CMPAR5_CMP4                     (*((volatile unsigned int*)(0x422B8A10UL)))
#define bM4_TMRA4_CMPAR5_CMP5                     (*((volatile unsigned int*)(0x422B8A14UL)))
#define bM4_TMRA4_CMPAR5_CMP6                     (*((volatile unsigned int*)(0x422B8A18UL)))
#define bM4_TMRA4_CMPAR5_CMP7                     (*((volatile unsigned int*)(0x422B8A1CUL)))
#define bM4_TMRA4_CMPAR5_CMP8                     (*((volatile unsigned int*)(0x422B8A20UL)))
#define bM4_TMRA4_CMPAR5_CMP9                     (*((volatile unsigned int*)(0x422B8A24UL)))
#define bM4_TMRA4_CMPAR5_CMP10                    (*((volatile unsigned int*)(0x422B8A28UL)))
#define bM4_TMRA4_CMPAR5_CMP11                    (*((volatile unsigned int*)(0x422B8A2CUL)))
#define bM4_TMRA4_CMPAR5_CMP12                    (*((volatile unsigned int*)(0x422B8A30UL)))
#define bM4_TMRA4_CMPAR5_CMP13                    (*((volatile unsigned int*)(0x422B8A34UL)))
#define bM4_TMRA4_CMPAR5_CMP14                    (*((volatile unsigned int*)(0x422B8A38UL)))
#define bM4_TMRA4_CMPAR5_CMP15                    (*((volatile unsigned int*)(0x422B8A3CUL)))
#define bM4_TMRA4_CMPAR6_CMP0                     (*((volatile unsigned int*)(0x422B8A80UL)))
#define bM4_TMRA4_CMPAR6_CMP1                     (*((volatile unsigned int*)(0x422B8A84UL)))
#define bM4_TMRA4_CMPAR6_CMP2                     (*((volatile unsigned int*)(0x422B8A88UL)))
#define bM4_TMRA4_CMPAR6_CMP3                     (*((volatile unsigned int*)(0x422B8A8CUL)))
#define bM4_TMRA4_CMPAR6_CMP4                     (*((volatile unsigned int*)(0x422B8A90UL)))
#define bM4_TMRA4_CMPAR6_CMP5                     (*((volatile unsigned int*)(0x422B8A94UL)))
#define bM4_TMRA4_CMPAR6_CMP6                     (*((volatile unsigned int*)(0x422B8A98UL)))
#define bM4_TMRA4_CMPAR6_CMP7                     (*((volatile unsigned int*)(0x422B8A9CUL)))
#define bM4_TMRA4_CMPAR6_CMP8                     (*((volatile unsigned int*)(0x422B8AA0UL)))
#define bM4_TMRA4_CMPAR6_CMP9                     (*((volatile unsigned int*)(0x422B8AA4UL)))
#define bM4_TMRA4_CMPAR6_CMP10                    (*((volatile unsigned int*)(0x422B8AA8UL)))
#define bM4_TMRA4_CMPAR6_CMP11                    (*((volatile unsigned int*)(0x422B8AACUL)))
#define bM4_TMRA4_CMPAR6_CMP12                    (*((volatile unsigned int*)(0x422B8AB0UL)))
#define bM4_TMRA4_CMPAR6_CMP13                    (*((volatile unsigned int*)(0x422B8AB4UL)))
#define bM4_TMRA4_CMPAR6_CMP14                    (*((volatile unsigned int*)(0x422B8AB8UL)))
#define bM4_TMRA4_CMPAR6_CMP15                    (*((volatile unsigned int*)(0x422B8ABCUL)))
#define bM4_TMRA4_CMPAR7_CMP0                     (*((volatile unsigned int*)(0x422B8B00UL)))
#define bM4_TMRA4_CMPAR7_CMP1                     (*((volatile unsigned int*)(0x422B8B04UL)))
#define bM4_TMRA4_CMPAR7_CMP2                     (*((volatile unsigned int*)(0x422B8B08UL)))
#define bM4_TMRA4_CMPAR7_CMP3                     (*((volatile unsigned int*)(0x422B8B0CUL)))
#define bM4_TMRA4_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422B8B10UL)))
#define bM4_TMRA4_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422B8B14UL)))
#define bM4_TMRA4_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422B8B18UL)))
#define bM4_TMRA4_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422B8B1CUL)))
#define bM4_TMRA4_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422B8B20UL)))
#define bM4_TMRA4_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422B8B24UL)))
#define bM4_TMRA4_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422B8B28UL)))
#define bM4_TMRA4_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422B8B2CUL)))
#define bM4_TMRA4_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422B8B30UL)))
#define bM4_TMRA4_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422B8B34UL)))
#define bM4_TMRA4_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422B8B38UL)))
#define bM4_TMRA4_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422B8B3CUL)))
#define bM4_TMRA4_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422B8B80UL)))
#define bM4_TMRA4_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422B8B84UL)))
#define bM4_TMRA4_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422B8B88UL)))
#define bM4_TMRA4_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422B8B8CUL)))
#define bM4_TMRA4_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422B8B90UL)))
#define bM4_TMRA4_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422B8B94UL)))
#define bM4_TMRA4_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422B8B98UL)))
#define bM4_TMRA4_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422B8B9CUL)))
#define bM4_TMRA4_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422B8BA0UL)))
#define bM4_TMRA4_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422B8BA4UL)))
#define bM4_TMRA4_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422B8BA8UL)))
#define bM4_TMRA4_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422B8BACUL)))
#define bM4_TMRA4_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422B8BB0UL)))
#define bM4_TMRA4_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422B8BB4UL)))
#define bM4_TMRA4_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422B8BB8UL)))
#define bM4_TMRA4_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422B8BBCUL)))
#define bM4_TMRA4_BCSTR_START                     (*((volatile unsigned int*)(0x422B9000UL)))
#define bM4_TMRA4_BCSTR_DIR                       (*((volatile unsigned int*)(0x422B9004UL)))
#define bM4_TMRA4_BCSTR_MODE                      (*((volatile unsigned int*)(0x422B9008UL)))
#define bM4_TMRA4_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422B900CUL)))
#define bM4_TMRA4_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422B9010UL)))
#define bM4_TMRA4_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422B9014UL)))
#define bM4_TMRA4_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422B9018UL)))
#define bM4_TMRA4_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422B901CUL)))
#define bM4_TMRA4_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422B9030UL)))
#define bM4_TMRA4_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422B9034UL)))
#define bM4_TMRA4_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422B9038UL)))
#define bM4_TMRA4_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422B903CUL)))
#define bM4_TMRA4_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422B9080UL)))
#define bM4_TMRA4_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422B9084UL)))
#define bM4_TMRA4_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422B9088UL)))
#define bM4_TMRA4_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422B9090UL)))
#define bM4_TMRA4_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422B9094UL)))
#define bM4_TMRA4_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422B9098UL)))
#define bM4_TMRA4_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422B90A0UL)))
#define bM4_TMRA4_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422B90A4UL)))
#define bM4_TMRA4_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422B90A8UL)))
#define bM4_TMRA4_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422B90B0UL)))
#define bM4_TMRA4_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422B90B4UL)))
#define bM4_TMRA4_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422B90B8UL)))
#define bM4_TMRA4_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422B90BCUL)))
#define bM4_TMRA4_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422B9100UL)))
#define bM4_TMRA4_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422B9104UL)))
#define bM4_TMRA4_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x422B9108UL)))
#define bM4_TMRA4_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x422B910CUL)))
#define bM4_TMRA4_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x422B9110UL)))
#define bM4_TMRA4_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x422B9114UL)))
#define bM4_TMRA4_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x422B9118UL)))
#define bM4_TMRA4_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x422B911CUL)))
#define bM4_TMRA4_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x422B9120UL)))
#define bM4_TMRA4_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x422B9124UL)))
#define bM4_TMRA4_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x422B9128UL)))
#define bM4_TMRA4_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x422B912CUL)))
#define bM4_TMRA4_HCUPR_HCUP12                    (*((volatile unsigned int*)(0x422B9130UL)))
#define bM4_TMRA4_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x422B9180UL)))
#define bM4_TMRA4_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x422B9184UL)))
#define bM4_TMRA4_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x422B9188UL)))
#define bM4_TMRA4_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x422B918CUL)))
#define bM4_TMRA4_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x422B9190UL)))
#define bM4_TMRA4_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x422B9194UL)))
#define bM4_TMRA4_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x422B9198UL)))
#define bM4_TMRA4_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x422B919CUL)))
#define bM4_TMRA4_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x422B91A0UL)))
#define bM4_TMRA4_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x422B91A4UL)))
#define bM4_TMRA4_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x422B91A8UL)))
#define bM4_TMRA4_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x422B91ACUL)))
#define bM4_TMRA4_HCDOR_HCDO12                    (*((volatile unsigned int*)(0x422B91B0UL)))
#define bM4_TMRA4_ICONR_ITEN1                     (*((volatile unsigned int*)(0x422B9200UL)))
#define bM4_TMRA4_ICONR_ITEN2                     (*((volatile unsigned int*)(0x422B9204UL)))
#define bM4_TMRA4_ICONR_ITEN3                     (*((volatile unsigned int*)(0x422B9208UL)))
#define bM4_TMRA4_ICONR_ITEN4                     (*((volatile unsigned int*)(0x422B920CUL)))
#define bM4_TMRA4_ICONR_ITEN5                     (*((volatile unsigned int*)(0x422B9210UL)))
#define bM4_TMRA4_ICONR_ITEN6                     (*((volatile unsigned int*)(0x422B9214UL)))
#define bM4_TMRA4_ICONR_ITEN7                     (*((volatile unsigned int*)(0x422B9218UL)))
#define bM4_TMRA4_ICONR_ITEN8                     (*((volatile unsigned int*)(0x422B921CUL)))
#define bM4_TMRA4_ECONR_ETEN1                     (*((volatile unsigned int*)(0x422B9280UL)))
#define bM4_TMRA4_ECONR_ETEN2                     (*((volatile unsigned int*)(0x422B9284UL)))
#define bM4_TMRA4_ECONR_ETEN3                     (*((volatile unsigned int*)(0x422B9288UL)))
#define bM4_TMRA4_ECONR_ETEN4                     (*((volatile unsigned int*)(0x422B928CUL)))
#define bM4_TMRA4_ECONR_ETEN5                     (*((volatile unsigned int*)(0x422B9290UL)))
#define bM4_TMRA4_ECONR_ETEN6                     (*((volatile unsigned int*)(0x422B9294UL)))
#define bM4_TMRA4_ECONR_ETEN7                     (*((volatile unsigned int*)(0x422B9298UL)))
#define bM4_TMRA4_ECONR_ETEN8                     (*((volatile unsigned int*)(0x422B929CUL)))
#define bM4_TMRA4_FCONR_NOFIENTG                  (*((volatile unsigned int*)(0x422B9300UL)))
#define bM4_TMRA4_FCONR_NOFICKTG0                 (*((volatile unsigned int*)(0x422B9304UL)))
#define bM4_TMRA4_FCONR_NOFICKTG1                 (*((volatile unsigned int*)(0x422B9308UL)))
#define bM4_TMRA4_FCONR_NOFIENCA                  (*((volatile unsigned int*)(0x422B9320UL)))
#define bM4_TMRA4_FCONR_NOFICKCA0                 (*((volatile unsigned int*)(0x422B9324UL)))
#define bM4_TMRA4_FCONR_NOFICKCA1                 (*((volatile unsigned int*)(0x422B9328UL)))
#define bM4_TMRA4_FCONR_NOFIENCB                  (*((volatile unsigned int*)(0x422B9330UL)))
#define bM4_TMRA4_FCONR_NOFICKCB0                 (*((volatile unsigned int*)(0x422B9334UL)))
#define bM4_TMRA4_FCONR_NOFICKCB1                 (*((volatile unsigned int*)(0x422B9338UL)))
#define bM4_TMRA4_STFLR_CMPF1                     (*((volatile unsigned int*)(0x422B9380UL)))
#define bM4_TMRA4_STFLR_CMPF2                     (*((volatile unsigned int*)(0x422B9384UL)))
#define bM4_TMRA4_STFLR_CMPF3                     (*((volatile unsigned int*)(0x422B9388UL)))
#define bM4_TMRA4_STFLR_CMPF4                     (*((volatile unsigned int*)(0x422B938CUL)))
#define bM4_TMRA4_STFLR_CMPF5                     (*((volatile unsigned int*)(0x422B9390UL)))
#define bM4_TMRA4_STFLR_CMPF6                     (*((volatile unsigned int*)(0x422B9394UL)))
#define bM4_TMRA4_STFLR_CMPF7                     (*((volatile unsigned int*)(0x422B9398UL)))
#define bM4_TMRA4_STFLR_CMPF8                     (*((volatile unsigned int*)(0x422B939CUL)))
#define bM4_TMRA4_BCONR1_BEN                      (*((volatile unsigned int*)(0x422B9800UL)))
#define bM4_TMRA4_BCONR1_BSE0                     (*((volatile unsigned int*)(0x422B9804UL)))
#define bM4_TMRA4_BCONR1_BSE1                     (*((volatile unsigned int*)(0x422B9808UL)))
#define bM4_TMRA4_BCONR2_BEN                      (*((volatile unsigned int*)(0x422B9900UL)))
#define bM4_TMRA4_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422B9904UL)))
#define bM4_TMRA4_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422B9908UL)))
#define bM4_TMRA4_BCONR3_BEN                      (*((volatile unsigned int*)(0x422B9A00UL)))
#define bM4_TMRA4_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422B9A04UL)))
#define bM4_TMRA4_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422B9A08UL)))
#define bM4_TMRA4_BCONR4_BEN                      (*((volatile unsigned int*)(0x422B9B00UL)))
#define bM4_TMRA4_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422B9B04UL)))
#define bM4_TMRA4_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422B9B08UL)))
#define bM4_TMRA4_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422BA000UL)))
#define bM4_TMRA4_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422BA010UL)))
#define bM4_TMRA4_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422BA014UL)))
#define bM4_TMRA4_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422BA018UL)))
#define bM4_TMRA4_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422BA020UL)))
#define bM4_TMRA4_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422BA024UL)))
#define bM4_TMRA4_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422BA030UL)))
#define bM4_TMRA4_CCONR1_NOFICKCP0                (*((volatile unsigned int*)(0x422BA034UL)))
#define bM4_TMRA4_CCONR1_NOFICKCP1                (*((volatile unsigned int*)(0x422BA038UL)))
#define bM4_TMRA4_CCONR2_CAPMD                    (*((volatile unsigned int*)(0x422BA080UL)))
#define bM4_TMRA4_CCONR2_HICP0                    (*((volatile unsigned int*)(0x422BA090UL)))
#define bM4_TMRA4_CCONR2_HICP1                    (*((volatile unsigned int*)(0x422BA094UL)))
#define bM4_TMRA4_CCONR2_HICP2                    (*((volatile unsigned int*)(0x422BA098UL)))
#define bM4_TMRA4_CCONR2_HICP3                    (*((volatile unsigned int*)(0x422BA0A0UL)))
#define bM4_TMRA4_CCONR2_HICP4                    (*((volatile unsigned int*)(0x422BA0A4UL)))
#define bM4_TMRA4_CCONR2_NOFIENCP                 (*((volatile unsigned int*)(0x422BA0B0UL)))
#define bM4_TMRA4_CCONR2_NOFICKCP0                (*((volatile unsigned int*)(0x422BA0B4UL)))
#define bM4_TMRA4_CCONR2_NOFICKCP1                (*((volatile unsigned int*)(0x422BA0B8UL)))
#define bM4_TMRA4_CCONR3_CAPMD                    (*((volatile unsigned int*)(0x422BA100UL)))
#define bM4_TMRA4_CCONR3_HICP0                    (*((volatile unsigned int*)(0x422BA110UL)))
#define bM4_TMRA4_CCONR3_HICP1                    (*((volatile unsigned int*)(0x422BA114UL)))
#define bM4_TMRA4_CCONR3_HICP2                    (*((volatile unsigned int*)(0x422BA118UL)))
#define bM4_TMRA4_CCONR3_HICP3                    (*((volatile unsigned int*)(0x422BA120UL)))
#define bM4_TMRA4_CCONR3_HICP4                    (*((volatile unsigned int*)(0x422BA124UL)))
#define bM4_TMRA4_CCONR3_NOFIENCP                 (*((volatile unsigned int*)(0x422BA130UL)))
