thtfcccj/CMSIS/hc32f46xb.h
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ14              (*((volatile unsigned int*)(0x43813238UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ15              (*((volatile unsigned int*)(0x4381323CUL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ16              (*((volatile unsigned int*)(0x43813240UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ17              (*((volatile unsigned int*)(0x43813244UL)))
#define bM4_USBFS_DIEPTSIZ4_XFRSIZ18              (*((volatile unsigned int*)(0x43813248UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT0               (*((volatile unsigned int*)(0x4381324CUL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT1               (*((volatile unsigned int*)(0x43813250UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT2               (*((volatile unsigned int*)(0x43813254UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT3               (*((volatile unsigned int*)(0x43813258UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT4               (*((volatile unsigned int*)(0x4381325CUL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT5               (*((volatile unsigned int*)(0x43813260UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT6               (*((volatile unsigned int*)(0x43813264UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT7               (*((volatile unsigned int*)(0x43813268UL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT8               (*((volatile unsigned int*)(0x4381326CUL)))
#define bM4_USBFS_DIEPTSIZ4_PKTCNT9               (*((volatile unsigned int*)(0x43813270UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV0             (*((volatile unsigned int*)(0x43813300UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV1             (*((volatile unsigned int*)(0x43813304UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV2             (*((volatile unsigned int*)(0x43813308UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV3             (*((volatile unsigned int*)(0x4381330CUL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV4             (*((volatile unsigned int*)(0x43813310UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV5             (*((volatile unsigned int*)(0x43813314UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV6             (*((volatile unsigned int*)(0x43813318UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV7             (*((volatile unsigned int*)(0x4381331CUL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV8             (*((volatile unsigned int*)(0x43813320UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV9             (*((volatile unsigned int*)(0x43813324UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV10            (*((volatile unsigned int*)(0x43813328UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV11            (*((volatile unsigned int*)(0x4381332CUL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV12            (*((volatile unsigned int*)(0x43813330UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV13            (*((volatile unsigned int*)(0x43813334UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV14            (*((volatile unsigned int*)(0x43813338UL)))
#define bM4_USBFS_DTXFSTS4_INEPTFSAV15            (*((volatile unsigned int*)(0x4381333CUL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ0                 (*((volatile unsigned int*)(0x43813400UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ1                 (*((volatile unsigned int*)(0x43813404UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ2                 (*((volatile unsigned int*)(0x43813408UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ3                 (*((volatile unsigned int*)(0x4381340CUL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ4                 (*((volatile unsigned int*)(0x43813410UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ5                 (*((volatile unsigned int*)(0x43813414UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ6                 (*((volatile unsigned int*)(0x43813418UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ7                 (*((volatile unsigned int*)(0x4381341CUL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ8                 (*((volatile unsigned int*)(0x43813420UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ9                 (*((volatile unsigned int*)(0x43813424UL)))
#define bM4_USBFS_DIEPCTL5_MPSIZ10                (*((volatile unsigned int*)(0x43813428UL)))
#define bM4_USBFS_DIEPCTL5_USBAEP                 (*((volatile unsigned int*)(0x4381343CUL)))
#define bM4_USBFS_DIEPCTL5_EONUM_DPID             (*((volatile unsigned int*)(0x43813440UL)))
#define bM4_USBFS_DIEPCTL5_NAKSTS                 (*((volatile unsigned int*)(0x43813444UL)))
#define bM4_USBFS_DIEPCTL5_EPTYP0                 (*((volatile unsigned int*)(0x43813448UL)))
#define bM4_USBFS_DIEPCTL5_EPTYP1                 (*((volatile unsigned int*)(0x4381344CUL)))
#define bM4_USBFS_DIEPCTL5_STALL                  (*((volatile unsigned int*)(0x43813454UL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM0                (*((volatile unsigned int*)(0x43813458UL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM1                (*((volatile unsigned int*)(0x4381345CUL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM2                (*((volatile unsigned int*)(0x43813460UL)))
#define bM4_USBFS_DIEPCTL5_TXFNUM3                (*((volatile unsigned int*)(0x43813464UL)))
#define bM4_USBFS_DIEPCTL5_CNAK                   (*((volatile unsigned int*)(0x43813468UL)))
#define bM4_USBFS_DIEPCTL5_SNAK                   (*((volatile unsigned int*)(0x4381346CUL)))
#define bM4_USBFS_DIEPCTL5_SD0PID_SEVNFRM         (*((volatile unsigned int*)(0x43813470UL)))
#define bM4_USBFS_DIEPCTL5_SODDFRM                (*((volatile unsigned int*)(0x43813474UL)))
#define bM4_USBFS_DIEPCTL5_EPDIS                  (*((volatile unsigned int*)(0x43813478UL)))
#define bM4_USBFS_DIEPCTL5_EPENA                  (*((volatile unsigned int*)(0x4381347CUL)))
#define bM4_USBFS_DIEPINT5_XFRC                   (*((volatile unsigned int*)(0x43813500UL)))
#define bM4_USBFS_DIEPINT5_EPDISD                 (*((volatile unsigned int*)(0x43813504UL)))
#define bM4_USBFS_DIEPINT5_TOC                    (*((volatile unsigned int*)(0x4381350CUL)))
#define bM4_USBFS_DIEPINT5_TTXFE                  (*((volatile unsigned int*)(0x43813510UL)))
#define bM4_USBFS_DIEPINT5_INEPNE                 (*((volatile unsigned int*)(0x43813518UL)))
#define bM4_USBFS_DIEPINT5_TXFE                   (*((volatile unsigned int*)(0x4381351CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ0               (*((volatile unsigned int*)(0x43813600UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ1               (*((volatile unsigned int*)(0x43813604UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ2               (*((volatile unsigned int*)(0x43813608UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ3               (*((volatile unsigned int*)(0x4381360CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ4               (*((volatile unsigned int*)(0x43813610UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ5               (*((volatile unsigned int*)(0x43813614UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ6               (*((volatile unsigned int*)(0x43813618UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ7               (*((volatile unsigned int*)(0x4381361CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ8               (*((volatile unsigned int*)(0x43813620UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ9               (*((volatile unsigned int*)(0x43813624UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ10              (*((volatile unsigned int*)(0x43813628UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ11              (*((volatile unsigned int*)(0x4381362CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ12              (*((volatile unsigned int*)(0x43813630UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ13              (*((volatile unsigned int*)(0x43813634UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ14              (*((volatile unsigned int*)(0x43813638UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ15              (*((volatile unsigned int*)(0x4381363CUL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ16              (*((volatile unsigned int*)(0x43813640UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ17              (*((volatile unsigned int*)(0x43813644UL)))
#define bM4_USBFS_DIEPTSIZ5_XFRSIZ18              (*((volatile unsigned int*)(0x43813648UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT0               (*((volatile unsigned int*)(0x4381364CUL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT1               (*((volatile unsigned int*)(0x43813650UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT2               (*((volatile unsigned int*)(0x43813654UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT3               (*((volatile unsigned int*)(0x43813658UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT4               (*((volatile unsigned int*)(0x4381365CUL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT5               (*((volatile unsigned int*)(0x43813660UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT6               (*((volatile unsigned int*)(0x43813664UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT7               (*((volatile unsigned int*)(0x43813668UL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT8               (*((volatile unsigned int*)(0x4381366CUL)))
#define bM4_USBFS_DIEPTSIZ5_PKTCNT9               (*((volatile unsigned int*)(0x43813670UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV0             (*((volatile unsigned int*)(0x43813700UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV1             (*((volatile unsigned int*)(0x43813704UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV2             (*((volatile unsigned int*)(0x43813708UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV3             (*((volatile unsigned int*)(0x4381370CUL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV4             (*((volatile unsigned int*)(0x43813710UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV5             (*((volatile unsigned int*)(0x43813714UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV6             (*((volatile unsigned int*)(0x43813718UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV7             (*((volatile unsigned int*)(0x4381371CUL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV8             (*((volatile unsigned int*)(0x43813720UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV9             (*((volatile unsigned int*)(0x43813724UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV10            (*((volatile unsigned int*)(0x43813728UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV11            (*((volatile unsigned int*)(0x4381372CUL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV12            (*((volatile unsigned int*)(0x43813730UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV13            (*((volatile unsigned int*)(0x43813734UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV14            (*((volatile unsigned int*)(0x43813738UL)))
#define bM4_USBFS_DTXFSTS5_INEPTFSAV15            (*((volatile unsigned int*)(0x4381373CUL)))
#define bM4_USBFS_DOEPCTL0_MPSIZ0                 (*((volatile unsigned int*)(0x43816000UL)))
#define bM4_USBFS_DOEPCTL0_MPSIZ1                 (*((volatile unsigned int*)(0x43816004UL)))
#define bM4_USBFS_DOEPCTL0_USBAEP                 (*((volatile unsigned int*)(0x4381603CUL)))
#define bM4_USBFS_DOEPCTL0_NAKSTS                 (*((volatile unsigned int*)(0x43816044UL)))
#define bM4_USBFS_DOEPCTL0_EPTYP0                 (*((volatile unsigned int*)(0x43816048UL)))
#define bM4_USBFS_DOEPCTL0_EPTYP1                 (*((volatile unsigned int*)(0x4381604CUL)))
#define bM4_USBFS_DOEPCTL0_SNPM                   (*((volatile unsigned int*)(0x43816050UL)))
#define bM4_USBFS_DOEPCTL0_STALL                  (*((volatile unsigned int*)(0x43816054UL)))
#define bM4_USBFS_DOEPCTL0_CNAK                   (*((volatile unsigned int*)(0x43816068UL)))
#define bM4_USBFS_DOEPCTL0_SNAK                   (*((volatile unsigned int*)(0x4381606CUL)))
#define bM4_USBFS_DOEPCTL0_EPDIS                  (*((volatile unsigned int*)(0x43816078UL)))
#define bM4_USBFS_DOEPCTL0_EPENA                  (*((volatile unsigned int*)(0x4381607CUL)))
#define bM4_USBFS_DOEPINT0_XFRC                   (*((volatile unsigned int*)(0x43816100UL)))
#define bM4_USBFS_DOEPINT0_EPDISD                 (*((volatile unsigned int*)(0x43816104UL)))
#define bM4_USBFS_DOEPINT0_STUP                   (*((volatile unsigned int*)(0x4381610CUL)))
#define bM4_USBFS_DOEPINT0_OTEPDIS                (*((volatile unsigned int*)(0x43816110UL)))
#define bM4_USBFS_DOEPINT0_B2BSTUP                (*((volatile unsigned int*)(0x43816118UL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ0               (*((volatile unsigned int*)(0x43816200UL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ1               (*((volatile unsigned int*)(0x43816204UL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ2               (*((volatile unsigned int*)(0x43816208UL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ3               (*((volatile unsigned int*)(0x4381620CUL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ4               (*((volatile unsigned int*)(0x43816210UL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ5               (*((volatile unsigned int*)(0x43816214UL)))
#define bM4_USBFS_DOEPTSIZ0_XFRSIZ6               (*((volatile unsigned int*)(0x43816218UL)))
#define bM4_USBFS_DOEPTSIZ0_PKTCNT                (*((volatile unsigned int*)(0x4381624CUL)))
#define bM4_USBFS_DOEPTSIZ0_STUPCNT0              (*((volatile unsigned int*)(0x43816274UL)))
#define bM4_USBFS_DOEPTSIZ0_STUPCNT1              (*((volatile unsigned int*)(0x43816278UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ0                 (*((volatile unsigned int*)(0x43816400UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ1                 (*((volatile unsigned int*)(0x43816404UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ2                 (*((volatile unsigned int*)(0x43816408UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ3                 (*((volatile unsigned int*)(0x4381640CUL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ4                 (*((volatile unsigned int*)(0x43816410UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ5                 (*((volatile unsigned int*)(0x43816414UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ6                 (*((volatile unsigned int*)(0x43816418UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ7                 (*((volatile unsigned int*)(0x4381641CUL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ8                 (*((volatile unsigned int*)(0x43816420UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ9                 (*((volatile unsigned int*)(0x43816424UL)))
#define bM4_USBFS_DOEPCTL1_MPSIZ10                (*((volatile unsigned int*)(0x43816428UL)))
#define bM4_USBFS_DOEPCTL1_USBAEP                 (*((volatile unsigned int*)(0x4381643CUL)))
#define bM4_USBFS_DOEPCTL1_DPID                   (*((volatile unsigned int*)(0x43816440UL)))
#define bM4_USBFS_DOEPCTL1_NAKSTS                 (*((volatile unsigned int*)(0x43816444UL)))
#define bM4_USBFS_DOEPCTL1_EPTYP0                 (*((volatile unsigned int*)(0x43816448UL)))
#define bM4_USBFS_DOEPCTL1_EPTYP1                 (*((volatile unsigned int*)(0x4381644CUL)))
#define bM4_USBFS_DOEPCTL1_SNPM                   (*((volatile unsigned int*)(0x43816450UL)))
#define bM4_USBFS_DOEPCTL1_STALL                  (*((volatile unsigned int*)(0x43816454UL)))
#define bM4_USBFS_DOEPCTL1_CNAK                   (*((volatile unsigned int*)(0x43816468UL)))
#define bM4_USBFS_DOEPCTL1_SNAK                   (*((volatile unsigned int*)(0x4381646CUL)))
#define bM4_USBFS_DOEPCTL1_SD0PID                 (*((volatile unsigned int*)(0x43816470UL)))
#define bM4_USBFS_DOEPCTL1_SD1PID                 (*((volatile unsigned int*)(0x43816474UL)))
#define bM4_USBFS_DOEPCTL1_EPDIS                  (*((volatile unsigned int*)(0x43816478UL)))
#define bM4_USBFS_DOEPCTL1_EPENA                  (*((volatile unsigned int*)(0x4381647CUL)))
#define bM4_USBFS_DOEPINT1_XFRC                   (*((volatile unsigned int*)(0x43816500UL)))
#define bM4_USBFS_DOEPINT1_EPDISD                 (*((volatile unsigned int*)(0x43816504UL)))
#define bM4_USBFS_DOEPINT1_STUP                   (*((volatile unsigned int*)(0x4381650CUL)))
#define bM4_USBFS_DOEPINT1_OTEPDIS                (*((volatile unsigned int*)(0x43816510UL)))
#define bM4_USBFS_DOEPINT1_B2BSTUP                (*((volatile unsigned int*)(0x43816518UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ0               (*((volatile unsigned int*)(0x43816600UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ1               (*((volatile unsigned int*)(0x43816604UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ2               (*((volatile unsigned int*)(0x43816608UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ3               (*((volatile unsigned int*)(0x4381660CUL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ4               (*((volatile unsigned int*)(0x43816610UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ5               (*((volatile unsigned int*)(0x43816614UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ6               (*((volatile unsigned int*)(0x43816618UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ7               (*((volatile unsigned int*)(0x4381661CUL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ8               (*((volatile unsigned int*)(0x43816620UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ9               (*((volatile unsigned int*)(0x43816624UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ10              (*((volatile unsigned int*)(0x43816628UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ11              (*((volatile unsigned int*)(0x4381662CUL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ12              (*((volatile unsigned int*)(0x43816630UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ13              (*((volatile unsigned int*)(0x43816634UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ14              (*((volatile unsigned int*)(0x43816638UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ15              (*((volatile unsigned int*)(0x4381663CUL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ16              (*((volatile unsigned int*)(0x43816640UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ17              (*((volatile unsigned int*)(0x43816644UL)))
#define bM4_USBFS_DOEPTSIZ1_XFRSIZ18              (*((volatile unsigned int*)(0x43816648UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT0               (*((volatile unsigned int*)(0x4381664CUL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT1               (*((volatile unsigned int*)(0x43816650UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT2               (*((volatile unsigned int*)(0x43816654UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT3               (*((volatile unsigned int*)(0x43816658UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT4               (*((volatile unsigned int*)(0x4381665CUL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT5               (*((volatile unsigned int*)(0x43816660UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT6               (*((volatile unsigned int*)(0x43816664UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT7               (*((volatile unsigned int*)(0x43816668UL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT8               (*((volatile unsigned int*)(0x4381666CUL)))
#define bM4_USBFS_DOEPTSIZ1_PKTCNT9               (*((volatile unsigned int*)(0x43816670UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ0                 (*((volatile unsigned int*)(0x43816800UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ1                 (*((volatile unsigned int*)(0x43816804UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ2                 (*((volatile unsigned int*)(0x43816808UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ3                 (*((volatile unsigned int*)(0x4381680CUL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ4                 (*((volatile unsigned int*)(0x43816810UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ5                 (*((volatile unsigned int*)(0x43816814UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ6                 (*((volatile unsigned int*)(0x43816818UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ7                 (*((volatile unsigned int*)(0x4381681CUL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ8                 (*((volatile unsigned int*)(0x43816820UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ9                 (*((volatile unsigned int*)(0x43816824UL)))
#define bM4_USBFS_DOEPCTL2_MPSIZ10                (*((volatile unsigned int*)(0x43816828UL)))
#define bM4_USBFS_DOEPCTL2_USBAEP                 (*((volatile unsigned int*)(0x4381683CUL)))
#define bM4_USBFS_DOEPCTL2_DPID                   (*((volatile unsigned int*)(0x43816840UL)))
#define bM4_USBFS_DOEPCTL2_NAKSTS                 (*((volatile unsigned int*)(0x43816844UL)))
#define bM4_USBFS_DOEPCTL2_EPTYP0                 (*((volatile unsigned int*)(0x43816848UL)))
#define bM4_USBFS_DOEPCTL2_EPTYP1                 (*((volatile unsigned int*)(0x4381684CUL)))
#define bM4_USBFS_DOEPCTL2_SNPM                   (*((volatile unsigned int*)(0x43816850UL)))
#define bM4_USBFS_DOEPCTL2_STALL                  (*((volatile unsigned int*)(0x43816854UL)))
#define bM4_USBFS_DOEPCTL2_CNAK                   (*((volatile unsigned int*)(0x43816868UL)))
#define bM4_USBFS_DOEPCTL2_SNAK                   (*((volatile unsigned int*)(0x4381686CUL)))
#define bM4_USBFS_DOEPCTL2_SD0PID                 (*((volatile unsigned int*)(0x43816870UL)))
#define bM4_USBFS_DOEPCTL2_SD1PID                 (*((volatile unsigned int*)(0x43816874UL)))
#define bM4_USBFS_DOEPCTL2_EPDIS                  (*((volatile unsigned int*)(0x43816878UL)))
#define bM4_USBFS_DOEPCTL2_EPENA                  (*((volatile unsigned int*)(0x4381687CUL)))
#define bM4_USBFS_DOEPINT2_XFRC                   (*((volatile unsigned int*)(0x43816900UL)))
#define bM4_USBFS_DOEPINT2_EPDISD                 (*((volatile unsigned int*)(0x43816904UL)))
#define bM4_USBFS_DOEPINT2_STUP                   (*((volatile unsigned int*)(0x4381690CUL)))
#define bM4_USBFS_DOEPINT2_OTEPDIS                (*((volatile unsigned int*)(0x43816910UL)))
#define bM4_USBFS_DOEPINT2_B2BSTUP                (*((volatile unsigned int*)(0x43816918UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ0               (*((volatile unsigned int*)(0x43816A00UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ1               (*((volatile unsigned int*)(0x43816A04UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ2               (*((volatile unsigned int*)(0x43816A08UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ3               (*((volatile unsigned int*)(0x43816A0CUL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ4               (*((volatile unsigned int*)(0x43816A10UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ5               (*((volatile unsigned int*)(0x43816A14UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ6               (*((volatile unsigned int*)(0x43816A18UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ7               (*((volatile unsigned int*)(0x43816A1CUL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ8               (*((volatile unsigned int*)(0x43816A20UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ9               (*((volatile unsigned int*)(0x43816A24UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ10              (*((volatile unsigned int*)(0x43816A28UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ11              (*((volatile unsigned int*)(0x43816A2CUL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ12              (*((volatile unsigned int*)(0x43816A30UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ13              (*((volatile unsigned int*)(0x43816A34UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ14              (*((volatile unsigned int*)(0x43816A38UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ15              (*((volatile unsigned int*)(0x43816A3CUL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ16              (*((volatile unsigned int*)(0x43816A40UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ17              (*((volatile unsigned int*)(0x43816A44UL)))
#define bM4_USBFS_DOEPTSIZ2_XFRSIZ18              (*((volatile unsigned int*)(0x43816A48UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT0               (*((volatile unsigned int*)(0x43816A4CUL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT1               (*((volatile unsigned int*)(0x43816A50UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT2               (*((volatile unsigned int*)(0x43816A54UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT3               (*((volatile unsigned int*)(0x43816A58UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT4               (*((volatile unsigned int*)(0x43816A5CUL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT5               (*((volatile unsigned int*)(0x43816A60UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT6               (*((volatile unsigned int*)(0x43816A64UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT7               (*((volatile unsigned int*)(0x43816A68UL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT8               (*((volatile unsigned int*)(0x43816A6CUL)))
#define bM4_USBFS_DOEPTSIZ2_PKTCNT9               (*((volatile unsigned int*)(0x43816A70UL)))
#define bM4_USBFS_DOEPCTL3_MPSIZ0                 (*((volatile unsigned int*)(0x43816C00UL)))
#define bM4_USBFS_DOEPCTL3_MPSIZ1                 (*((volatile unsigned int*)(0x43816C04UL)))
#define bM4_USBFS_DOEPCTL3_MPSIZ2                 (*((volatile unsigned int*)(0x43816C08UL)))
